
// 函数：生成二进制码
void SAVE_BINARY() { }

/*
赵钱孙李 周吴郑王 冯陈诸卫 蒋沈韩杨 朱秦尤许 何吕施张 孔曹严华 金魏陶姜 戚谢邹喻 柏水窦章
云苏潘葛 奚范彭郎 鲁韦昌马 苗凤花方 俞任袁柳 酆鲍史唐 费廉岑薛 雷贺倪汤 滕殷罗毕 郝邬安常
乐于时傅 皮卡齐康 伍余元卜 顾孟平黄 和穆萧尹 姚邵堪汪 祁毛禹狄 米贝明臧 计伏成戴 谈宋茅庞
熊纪舒屈 项祝董粱 杜阮蓝闵 席季麻强 贾路娄危 江童颜郭 梅盛林刁 钟徐邱骆 高夏蔡田 樊胡凌霍
虞万支柯 咎管卢莫 经房裘缪 干解应宗 丁宣贲邓 郁单杭洪 包诸左石 崔吉钮龚 程嵇邢滑 裴陆荣翁
荀羊於惠 甄魏家封 芮羿储靳 汲邴糜松 井段富巫 乌焦巴弓 牧隗山谷 车侯宓蓬 全郗班仰 秋仲伊宫
宁仇栾暴 甘钭厉戎 祖武符刘 景詹束龙 叶幸司韶 郜黎蓟薄 印宿白怀 蒲台从鄂 索咸籍赖 卓蔺屠蒙
池乔阴郁 胥能苍双 闻莘党翟 谭贡劳逄 姬申扶堵 冉宰郦雍 卻璩桑桂 濮牛寿通 边扈燕冀 郏浦尚农
温别庄晏 柴翟阎充 慕连茹习 宦艾鱼容 向古易慎 戈廖庚终 暨居衡步 都耿满弘 匡国文寇 广禄阙东
殴殳沃利 蔚越夔隆 师巩厍聂 晁勾敖融 冷訾辛阚 那简饶空 曾毋沙乜 养鞠须丰 巢关蒯相 查后荆红
游竺权逯 盖後桓公 万俟司马 上官欧阳 夏侯诸葛 闻人东方 赫连皇甫 尉迟公羊 澹台公冶 宗政濮阳
淳于单于 太叔申屠 公孙仲孙 轩辕令狐 钟离宇文 长孙慕容 鲜于闾丘 司徒司空 亓官司寇 仉督子车
颛孙端木 巫马公西 漆雕乐正 壤驷公良 拓拔夹谷 宰父谷粱 晋楚闫法 汝鄢涂钦 段干百里 东郭南门
呼延归海 羊舌微生 岳帅缑亢 况后有琴 梁丘左丘 东门西门 商牟佘佴 伯赏南宫 墨哈谯笪 年爱阳佟
第五言福 百家姓终
*/

string *fname = ({
"赵","钱","孙","李","周","吴","郑","王","冯","陈","卫","蒋","沈","韩","杨","朱","秦","尤","许","何",
"吕","施","张","孔","曹","严","华","金","魏","陶","姜","戚","谢","邹","窦","云","苏","潘","范","彭",
"鲁","韦","马","苗","花","方","任","袁","柳","鲍","史","唐","岑","薛","雷","贺","倪","汤","殷","罗",
"郝","邬","于","傅","齐","伍","余","顾","孟","黄","穆","萧","肖","姚","汪","祁","毛","狄","臧","戴",
"宋","茅","庞","熊","纪","祝","董","梁","杜","阮","贾","江","童","颜","郭","梅","林","钟","徐","邱",
"骆","高","夏","蔡","田","胡","霍","万","柯","卢","莫","裘","丁","邓","洪","包","石","崔","龚","程",
"裴","陆","甄","段","乌","巴","宁","仇","刘","詹","龙","叶","白","池","乔","谭","牛","温","庄","柴",
"古","廖","曾","沙","关",
// "司马","上官","欧阳","东方","尉迟","令狐","慕容","呼延","西门","南宫",
});

int sizeof_fname = sizeof(fname);

string *criminal_name = ({    // 重犯

"老大","老二","老三","老四","老五","老六","老七","老八","老九",
"当家","老当家","大当家","二当家","三当家",
"老黑","大黑","二黑","三黑",
"胡子","大胡子","二胡子","三胡子",
"麻子","大麻子","二麻子","三麻子",
});

int sizeof_criminal_name = sizeof(criminal_name);

string *thief_name = ({    // 窃贼

"小三","小四","小五","小六","小七",
"鸡儿","狗儿","猫儿","兔儿",
});

int sizeof_thief_name = sizeof(thief_name);

string *banditi_name = ({    // 土匪

"老大","老二","老三","老四","老五","老六","老七","老八","老九",
"当家","老当家","大当家","二当家","三当家",
"老黑","大黑","二黑","三黑",
"胡子","大胡子","二胡子","三胡子",
"麻子","大麻子","二麻子","三麻子",
});

int sizeof_banditi_name = sizeof(banditi_name);

string *robber_name = ({    // 大盗

"老大","老二","老三","老四","老五","老六","老七","老八","老九",
"当家","老当家","大当家","二当家","三当家",
"老黑","大黑","二黑","三黑",
"胡子","大胡子","二胡子","三胡子",
"麻子","大麻子","二麻子","三麻子",
});

int sizeof_robber_name = sizeof(robber_name);

string *rascal_name = ({    // 混混

"小三","小四","小五","小六","小七",
});

int sizeof_rascal_name = sizeof(rascal_name);

string *rascal_name_2 = ({    // 恶少

"公子","老大","老二","老三","老四","老五","老六","老七",
});

int sizeof_rascal_name_2 = sizeof(rascal_name_2);

// 获取重犯姓名
string get_criminal_name() { return fname[ random(sizeof_fname) ] + criminal_name[ random(sizeof_criminal_name) ]; }

// 获取窃贼姓名
string get_thief_name() { return fname[ random(sizeof_fname) ] + thief_name[ random(sizeof_thief_name) ]; }

// 获取土匪姓名
string get_banditi_name() { return fname[ random(sizeof_fname) ] + banditi_name[ random(sizeof_banditi_name) ]; }

// 获取大盗姓名
string get_robber_name() { return fname[ random(sizeof_fname) ] + robber_name[ random(sizeof_robber_name) ]; }

// 获取混混姓名
string get_rascal_name() { return fname[ random(sizeof_fname) ] + rascal_name[ random(sizeof_rascal_name) ]; }

// 获取恶少姓名
string get_rascal_name_2() { return fname[ random(sizeof_fname) ] + rascal_name_2[ random(sizeof_rascal_name_2) ]; }
