
// 函数：生成二进制码
void SAVE_BINARY() { }

mapping LevelTarget =
        ([
		"1"     : ({ 3281, 3283, 3285, 3310, 3250, 3288, 3221, 3223, 3244, 3230, 3232, 3233, 3234, 3513, 3404,  }),
		"2"     : ({ 3153, 3512, 3514, 3325, 3303, 3156, 3321, 3154, 3155, 3152, 3604, 3505,  }),
		"3"	: ({ 3205, 3235, 3460, 3117, 3243, 3406, 3405, 3421, 3212, 3301, 3311, 3310, 3450, 3452, 3410, 4903, 3242, 3220, 3210, 3211, 3280, 3284, 3282, 3286, 3106, 3304, 3502, }),
		"4"	: ({ 3222, 3511, 3252, 3513, 3501, 3254, 3411, 3412, 3420, 3320, 3302, 3510, 3502, 4910, 3402, 3403, 3401, 3310, 3150, 3155, 3505, 3410, 3413, 3414, 3323, 3324, 3506, 3507, 3322,  }),
		"5"	: ({ 3244, 3224, 3303, 3304, 3310, 3311, 3101, 3102, 3103, 3284, 3241, 3287, 3322, 3325, 3320, 3104,  }),
		"6"	: ({ 3240, 3150, 3153, 3311, 3323, 3324, 3301, 3321, 3154, 3310, 3220, 3156, 3151, 3152, 3211,  }),
		"7"	: ({ 3501, 3502, 3506, 3505, 3507, 3515, 3563, 3453, 3450, 3451, 3455, 3456, 3454, 3460, 3461,  }),
		"8"	: ({ 3451, 3412, 3515, 3456, 3512, 3513, 3404, }),
		"9"	: ({ 3452, 3454, 3451, 3460, 3455, 3456, 3461, }),
		"10"	: ({ 3301, 3302, 3310, 3311, 3244, 3250, 3101, 3103, 3450, 3453, }),
		"11"	: ({ 3709, 3719, 3729, 3731, 3732, 3733, 3734, 3735, 3736, 3737, }),
		"12"	: ({ 3780, 3781, 3760, 3750, 3756, 3766, }),
        ]);
mapping mpMasterObj = ([
			0 : ({"短木刀","长矛","木剑","长木棍","粗麻手套"}),
			10: ({"单刀","铁矛","追风剑","寒铁棍","青藤拳套","碎石子","翠木剑","水木剑","云木剑",}),
			20: ({"月牙刀","黑铁矛","清风剑","青竹棍","鱼鳞拳套","柳叶镖","桃木剑","灵木剑","玄木剑",}),
			30: ({"寒铁刀","墨青戟","金蛇剑","檀紫棍","青铜拳套","飞蝗石","玄黄剑","冥黄剑","赤黄剑",}),
			40: ({"斩马刀","重翎枪","迎风斩","驱魔棍","精钢拳套","精钢镖","赤阳剑","朝阳剑","赤胆剑",}),
			50: ({"金环刀","玄墨矛","墨玉剑","狼牙棍","黄金珑手","如意珠","暗青剑","慑魂剑","寒青剑"}),
			60: ({"赤炼刀","锯齿枪","龙齿锏","玄纹棍","金缕拳套","袖箭","真武剑","玄魂剑","阴阳剑",}),
			]);
mapping LevelNpc =
        ([
                "1" : "小山鸡",
                "2" : "小蜜蜂",
                "3" : "斑点蛙",
                "5" : "持扇草人",
                "6" : "赤褐蚁",
                "7" : "子母蛙",
                "11" : "楚军刀兵",
                "12" : "棕熊",
                "13" : "狒狒",
                "14" : "绿臂螳螂",
                "16" : "独眼兽",
                "17" : "地痞",
                "18" : "打手",
                "21" : "鬼火",
                "22" : "恶老头",
                "23" : "恶屠",
                "24" : "狂徒",
                "25" : "巡城小兵",
                "26" : "强盗",
                "27" : "赵国巡逻兵",
                "28" : "鬼魅",
                "29" : "骷髅兵",
                "31" : "褐尾蝎",
                "32" : "狼妖",
                "33" : "猪妖",
                "34" : "豺狗",
                "36" : "水贼",
                "37" : "癞蛤蟆",
                "38" : "黑熊",
                "39" : "赤炎蛇",
                "40" : "螳螂妖",
                "41" : "虾兵",
                "42" : "蟹将",
                "46" : "壮丁",
                "47" : "苦役",
                "48" : "劳役",
                "51" : "绿壳蜘蛛",
                "52" : "大笨熊",
                "53" : "魍魉",
                "54" : "花豹精",
                "55" : "豺狼",
                "56" : "燕国刀盾兵",
                "57" : "燕国剑盾兵",
                "58" : "燕国枪兵",
                "62" : "赵国刀盾兵",
                "63" : "赵国剑盾兵",
                "64" : "赵国弓兵",
                "66" : "秦国刀盾兵",
                "67" : "秦国枪兵",
                "68" : "秦国弓兵",
                "72" : "劫匪",
                "73" : "密探",
                "74" : "水鬼",
                "76" : "罐中妖",
                "77" : "冤魂",
                "78" : "疫鬼",
                "79" : "恶灵",
                "81" : "铜甲尸",
                "82" : "铁甲尸",
                "83" : "刀盾骷髅",
                "84" : "僵尸",
                "85" : "石狮",
                "86" : "刀俑",
                "87" : "弓箭石俑",
                "88" : "枪俑",
                "89" : "剑俑",
                "91" : "骷髅妖",
                "92" : "尸魔",
                "93" : "怨灵",
                "96" : "金精",
                "97" : "木精",
                "98" : "水精",
                "99" : "火精",
                "100" : "土精",
                "102" : "罐中仙",
                "104" : "龟仙人",
                "106" : "天罡门众守",
                "107" : "地煞门众守",
                "108" : "太极门众守",
                "112" : "刀魂",
                "113" : "剑魂",
                "114" : "枪魂",

        ]);
mapping managername =
        ([
		"桃花源"        : "村民",
                "蜀山"          : "司库",
		"禁卫军"        : "后勤官",
                "唐门"          : "唐家总管",
		"茅山"          : "鬼卒",
                "昆仑山"        : "石狮",
		"云梦泽"        : "药童",
        ]);
mapping fightmap =
        ([
		"桃花源"        : 891,
                "蜀山"          : 892,
		"禁卫军"        : 893,
                "唐门"          : 894,
		"茅山"          : 895,
                "昆仑山"        : 896,
		"云梦泽"        : 897,
        ]);
mapping levelNPC1 = ([
	0 : 	([
		"小山鸡" : "在新手村可以捉到小山鸡",
		"小野兔" : "在新手村可以捉到小野兔",
		"小蜜蜂" : "在清溪可以捉到小蜜蜂",
		"小蚂蚁" : "在清溪可以捉到小蚂蚁",
		"斑点蛙" : "在幽谷可以捉到斑点蛙",
		]),
	1:	([
		"赤褐蚁" : "在巴丘可以捉到赤褐蚁",
		"子母蛙" : "在巴丘可以捉到子母蛙",		
		]),
	2:	([
		"楚军刀兵" : "在楚方城可以捉到楚军刀兵",
		"楚军剑兵" : "在楚方城可以捉到楚军剑兵",
		"四脚蛇" : "在华山可以捉到四脚蛇",
		"独角仙" : "在桃花源可以捉到独角仙",
		"刺尾蜂" : "在桃花源可以捉到刺尾蜂",
		"棕熊" : "在华山可以捉到棕熊",
		"狒狒" : "在朝阳峰可以捉到狒狒",
		"绿臂螳螂" : "在桃花源可以捉到绿臂螳螂",
		]),
	3:	([
		"独眼兽" : "在首阳山可以捉到独眼兽",		
		]),
	4: 	([
		"鬼火" : "在无定河畔可以捉到鬼火",
		"幽灵" : "在无定河可以捉到幽灵",
		"飞贼" : "在马陵道可以捉到飞贼",		
		"巡城小兵" : "在巨鹿可以捉到巡城小兵",	
		]),
	5: 	([
		"草寇" : "在桂陵可以捉到草寇",
		"赵国巡逻兵" : "在巨鹿可以捉到赵国巡逻兵",	
		"骷髅兵" : "在长平可以捉到骷髅兵",		
		]),
	6:	([
		"褐尾蝎" : "在沼泽边缘可以捉到褐尾蝎",
		"蛛蛛怪" : "在沼泽边缘可以捉到蛛蛛怪",
		"毒刺蜂" : "在沼泽边缘可以捉到毒刺蜂",
		"牛头怪" : "在大别山脚可以捉到牛头怪",		
		]),
	7:	([
		"水贼" : "在赤壁可以捉到水贼",
		"癞蛤蟆" : "在太湖可以捉到癞蛤蟆",
		"黑熊" : "在泰山山脚可以捉到黑熊",
		"赤炎蛇" : "在泰山可以捉到赤炎蛇",
		"螳螂妖" : "在泰山可以捉到螳螂妖",		
		]),		
	8:	([
		"虾兵" : "在东海渔村可以捉到虾兵",
		]),
	9:	([
		"壮丁" : "在郑国渠可以捉到壮丁",
		]),	
	10:	([
		"绿壳蜘蛛" : "在长白山可以捉到绿壳蜘蛛",
		"大笨熊" : "在玉柱峰可以捉到大笨熊",
		"魍魉" : "在白云峰可以捉到魍魉",
		]),
	11:	([
		"燕国刀盾兵" :	"在燕长城可以捉到燕国刀盾兵",
		"燕国剑盾兵" : "在燕长城可以捉到燕国剑盾兵",
		"燕国枪兵": "在燕长城可以捉到燕国枪兵",
		]),					
	12:	([
		"赵国刀盾兵" : "在赵长城可以捉到赵国刀盾兵",
		"赵国剑盾兵" : "在赵长城可以捉到赵国剑盾兵",
		"赵国弓兵" : "在赵长城可以捉到赵国弓兵",	
		]),
	13:	([
		"秦国枪兵" : "在秦长城可以捉到秦国枪兵",
		]),
	14:	([
		"水鬼": "在弯道可以捉到水鬼",
		]),
	15:	([
		"罐中妖" : "在灵谷洞一层可以捉到罐中妖",
		"恶灵" : "在灵谷洞三层可以捉到恶灵",
		]),
	16:	([
		"铜甲尸" : "在灵谷洞一层可以捉到铜甲尸",
		"侍卫亡灵" : "在灵谷洞二层可以捉到侍卫亡灵",
		"铁甲尸" : "在灵谷洞二层可以捉到铁甲尸",
		"刀盾骷髅" : "在万人坑可以捉到刀盾骷髅",
		"剑盾骷髅" : "在万人坑可以捉到剑盾骷髅",
		"双刀骷髅" : "在万人坑可以捉到双刀骷髅",
		"僵尸" : "在万人坑四层可以捉到僵尸",
		]),
	17:	([
		"石狮" : "在将军古墓一层可以捉到石狮",		
		"刀俑" : "在将军古墓二层可以捉到刀俑",
		"弓箭石俑" : "在将军古墓三层可以捉到弓箭石俑",
		]),
	18:	([
		"邪灵" : "在困魔阵二层可以捉到邪灵",
		"尸魔" : "在困魔阵二层可以捉到尸魔",
		]),
	19:	([
		"金精" : "在虚灵洞可以捉到金精",		
		]),
	20:	([
		"罐中仙" : "在九曲桥可以捉到罐中仙",
		"龟仙人" : "在九曲桥可以捉到龟仙人",		
		]),
	21:	([
		"守阵天兵" : "在天门阵一层可以捉到守阵天兵",
		"守阵神将" : "在天门阵一层可以捉到守阵神将",
		"太极门众守" : "在天门阵二层可以捉到太极门众守",
		]),
	22:	([
		"刀魂" : "在诛仙阵三层可以捉到刀魂",
		"剑魂" : "在诛仙阵四层可以捉到剑魂",
		"枪魂" : "在诛仙阵五层可以捉到枪魂",
		]),
	]);    
	
mapping LevelTarget1 = ([
	2:	([
		"破损的头盔" : "在楚方城杀楚军刀兵可以得到破损的头盔",
		"破损的盔甲" : "在楚方城杀楚军剑兵可以得到破损的盔甲",
		"蛇之冠" : "在华山杀四脚蛇可以得到蛇之冠",
		"甲虫翅膀" : "在桃花源杀独角仙可以得到甲虫翅膀",
		"黄蜂刺" : "在桃花源刺尾蜂可以得到黄蜂刺",
		"鱼骨" : "在华山杀棕熊可以得到鱼骨",
		"猴子尾巴" : "在朝阳峰杀狒狒可以得到猴子尾巴",
		"螳螂臂" : "在桃花源杀绿臂螳螂可以得到螳螂臂",
		"螳螂之翼" : "在桃花源杀绿臂螳螂可以得到螳螂之翼",		
		]),
	3:	([
		"狗尾巴" : "在首阳山杀独眼兽可以得到狗尾巴",
		]),
	4:	([
		"火种" : "在无定河一带杀鬼火可以得到火种",
		"珠串" : "在无定河畔杀幽灵可以得到珠串",
		"奶嘴" : "在马陵道杀飞贼可以得到奶嘴",
		"飞行扇" : "在马陵道杀飞贼可以得到飞行扇",
		"腰牌" : "在巨鹿杀巡城小兵可以得到腰牌",		
		]),
	5:	([
		"发束" : "在桂陵杀草寇可以得到发束",
		"狗皮药膏" : "在桂陵杀草寇可以得到狗皮膏药",
		"破旧的头盔" : "在巨鹿杀赵国巡逻兵可以得到破旧的头盔",
		"破旧的盔甲" : "在巨鹿杀赵国巡逻兵可以得到破旧的盔甲",
		"骸骨碎片" : "在长平杀骷髅兵可以得到骸骨碎片",		
		]),
	6:	([
		"蝎尾" : "在沼泽边缘杀褐尾蝎可以得到蝎尾",
		"蜘蛛丝" : "在沼泽边缘杀蛛蛛怪可以得到蜘蛛丝",
		"剧毒刺" : "在沼泽边缘杀毒刺蜂可以得到剧毒刺",
		"牛筋" : "在大别山脚杀牛头怪可以得到牛筋",
		"鼻环" : "在大别山脚杀牛头怪可以得到鼻环",
		]),
	7:	([
		"水贼头巾" : "在赤壁杀水贼可以得到水贼头巾",
		"蛙蹼" : "在太湖杀癞蛤蟆可以得到蛙蹼",
		"闪光的石头" : "在泰山山脚杀黑熊可以得到闪光的石头",
		"蜥蜴尾巴" : "在泰山杀赤炎蛇可以得到蜥蜴尾巴",
		"绿色小石头" : "在泰山杀螳螂妖可以得到绿色小石头",		
		]),
	8:	([
		"大钳子" : "在东海渔村杀虾兵可以得到大钳子",
		]),
	9:	([
		"破布衣" : "在郑国渠杀壮丁可以得到破布衣",
		]),
	10:	([
		"蛛网" : "在长白山杀绿壳蜘蛛可以得到蛛网",
		"蜘蛛丝" : "在长白山杀绿壳蜘蛛可以得到蜘蛛丝",
		"红色小石头" : "在玉柱峰杀大笨熊可以得到红色小石头",
		"鱼骨" : "在玉柱峰杀大笨熊可以得到鱼骨",
		"死者遗物" : "在白云峰杀魍魉可以得到死者遗物",		
		]),
	11:	([
		"帽缨" : "在燕长城杀燕国刀盾兵可以得到帽缨",
		"破旧的头盔" : "在燕长城杀燕国剑盾兵可以得到破旧的头盔",
		"破旧的盔甲" : "在燕长城杀燕国枪兵可以得到破旧的盔甲",		
		]),
	12:	([
		"刀柄" : "在赵长城杀赵国刀盾兵可以得到刀柄",
		"剑鞘" : "在赵长城杀赵国剑盾兵可以得到剑鞘",
		"箭筒" : "在赵长城杀赵国弓兵可以得到箭筒",		
		]),
	13:	([
		"枪头" : "在秦长城杀秦国枪兵可以得到枪头",
		]),
	14:	([
		"鱼叉" : "在弯道杀水鬼可以得到鱼叉",
		]),
	15:	([
		"铜罐" : "在灵谷洞一层杀罐中妖可以得到铜罐",
		"黄色小石头" : "在灵谷洞二层杀魍魉鬼可以得到黄色小石头",
		"腐骨" : "在灵谷洞三层杀恶灵可以得到腐骨",		
		]),
	16:	([
		"铜骸" : "在灵谷洞一层杀铜甲尸可以得到铜骸",
		"七色串珠" : "在灵谷洞二层杀侍卫亡灵可以得到七色珠串",
		"铁骸" : "在灵谷洞二层杀铁甲尸可以得到铁骸",
		"骨盾" : "在万人坑一层杀刀盾骷髅可以得到骨盾",
		"骷髅头" : "在困魔阵一层杀剑盾骷髅可以得到骷髅头",
		"桃木钉" : "在万人坑二层杀双刀骷髅可以得到桃木钉",
		"僵尸冠" : "在万人坑四层杀僵尸可以得到僵尸冠",
		"碎玉" : "在将军古墓一层杀石狮可以得到碎玉",		
		]),
	17:	([
		"陶俑之首" : "在将军古墓二层杀刀俑可以得到陶俑之首",
		"陶俑之臂" : "在将军古墓三层杀弓箭石俑可以得到陶俑之臂",
		]),
	18:	([
		"锁魔链" : "在困魔阵二层杀邪灵可以得到锁魔链",
		"甲胄" : "在困魔阵二层杀尸魔可以得到甲胄",		
		]),
	19:	([
		"小太极" : "在虚灵洞杀金精可以得到小太极",		
		]),
	20:	([
		"玉盖" : "在九曲桥杀罐中仙可以得到玉盖",
		"龟壳" : "在九曲桥杀龟仙人可以得到龟壳",
		"长寿石" : "在九曲桥杀龟仙人可以得到长寿石",		
		]),
	21:	([
		"玉束髻" : "在天门阵一层杀守阵天兵可以得到玉束髻",
		"火凤之翼" : "在天门阵一层杀守阵神将可以得到火凤之翼",
		"拂尘" : "在天门阵二层杀太极门众守可以得到拂尘",
		]),
	22:	([
		"寒铁刀柄" : "在诛仙阵三层杀刀魂可以得到寒铁刀柄",
		"寒铁剑鞘" : "在诛仙阵四层杀剑魂可以得到寒铁剑鞘",
		"寒铁枪头" : "在诛仙阵五层杀枪魂可以得到寒铁枪头",
		]),				
	]);
mapping mpSiku = ([
1:({
	({"桔子","酒店老板"}),({"地瓜","酒店老板"}),({"清水","酒店老板"}),({"正气散","药店老板"}),({"行军散","药店老板"}),({"砒霜","药店老板"}),({"短木刀","新手村的武器店老板"}),({"长矛","新手村的武器店老板"}),({"木剑","新手村的武器店老板"}),({"长木棍","新手村的武器店老板"}),({"粗麻手套","新手村的武器店老板"}),({"麻衣","新手村的防具店老板"}),({"麻衣","新手村的防具店老板"}),({"麻布帽","新手村的防具店老板"}),({"麻布帽","新手村的防具店老板"}),({"藤蔓鞋","新手村的防具店老板"}),({"符纸","杂货店老板"}),({"黄豆","杂货店老板"}),({"乾坤绳","杂货店老板"}),
   }),
2:({
	({"棉布衣","楚国的防具店老板"}),({"棉布衣","楚国的防具店老板"}),({"棉布帽","楚国的防具店老板"}),({"棉布帽","楚国的防具店老板"}),({"布鞋","楚国的防具店老板"}),({"单刀","楚国的武器店老板"}),({"铁矛","楚国的武器店老板"}),({"追风剑","楚国的武器店老板"}),({"寒铁棍","楚国的武器店老板"}),({"青藤拳套","楚国的武器店老板"}),({"碎石子","韩国的武器店老板"}),({"翠木剑","齐国的武器店老板"}),({"水木剑","秦国的武器店老板"}),({"云木剑","魏国的武器店老板"}),
   }),
3:({
	({"月牙刀","燕国的武器店老板"}),({"黑铁矛","周国的武器店老板"}),({"清风剑","燕国的武器店老板"}),({"青竹棍","周国的武器店老板"}),({"鱼鳞拳套","赵国的武器店老板"}),({"柳叶镖","韩国的武器店老板"}),({"桃木剑","齐国的武器店老板"}),({"灵木剑","秦国的武器店老板"}),({"玄木剑","魏国的武器店老板"}),({"寒铁刀","燕国的武器店老板"}),({"墨青戟","周国的武器店老板"}),({"金蛇剑","燕国的武器店老板"}),({"檀紫棍","周国的武器店老板"}),({"青铜拳套","赵国的武器店老板"}),({"飞蝗石","韩国的武器店老板"}),({"玄黄剑","齐国的武器店老板"}),({"冥黄剑","秦国的武器店老板"}),({"赤黄剑","魏国的武器店老板"}),({"皮衣","赵国的防具店老板"}),({"皮裙","赵国的防具店老板"}),({"丝绸衣","赵国的防具店老板"}),({"丝绸裙","赵国的防具店老板"}),({"青柳甲","燕国的防具店老板"}),({"青柳裙","燕国的防具店老板"}),({"沙场甲","周国的防具店老板"}),({"沙场裙","周国的防具店老板"}),({"碧龙衣","燕国的防具店老板"}),({"碧龙裙","燕国的防具店老板"}),({"狂战衣","周国的防具店老板"}),({"狂战裙","周国的防具店老板"}),
	({"随风衣","韩国的防具店老板"}),({"天水衣","韩国的防具店老板"}),({"随风裙","韩国的防具店老板"}),({"天水裙","韩国的防具店老板"}),({"细麻衣","秦国的防具店老板"}),({"青龙衣","秦国的防具店老板"}),({"细麻裙","秦国的防具店老板"}),({"青龙裙","秦国的防具店老板"}),({"古藤甲","齐国的防具店老板"}),({"玉露衣","齐国的防具店老板"}),({"古藤裙","齐国的防具店老板"}),({"玉露裙","齐国的防具店老板"}),({"古甲","魏国的防具店老板"}),({"传风衣","魏国的防具店老板"}),({"古甲裙","魏国的防具店老板"}),({"传风裙","魏国的防具店老板"}),({"皮革帽","赵国的防具店老板"}),({"丝绸帽","赵国的防具店老板"}),({"皮紫头巾","赵国的防具店老板"}),({"丝绸头巾","赵国的防具店老板"}),({"青柳帽","燕国的防具店老板"}),({"碧龙帽","燕国的防具店老板"}),({"青柳头巾","燕国的防具店老板"}),({"碧龙头巾","燕国的防具店老板"}),({"沙场帽","周国的防具店老板"}),({"狂战冠","周国的防具店老板"}),({"沙场头巾","周国的防具店老板"}),({"狂战头巾","周国的防具店老板"}),({"随风帽","韩国的防具店老板"}),({"天水帽","韩国的防具店老板"}),
	({"随风头巾","韩国的防具店老板"}),({"天水头巾","韩国的防具店老板"}),({"细麻帽","秦国的防具店老板"}),({"青龙帽","秦国的防具店老板"}),({"细麻头巾","秦国的防具店老板"}),({"青龙头巾","秦国的防具店老板"}),({"古藤帽","齐国的防具店老板"}),({"玉露帽","齐国的防具店老板"}),({"古藤头巾","齐国的防具店老板"}),({"玉露头巾","齐国的防具店老板"}),({"古甲帽","魏国的防具店老板"}),({"传风冠","魏国的防具店老板"}),({"古甲头巾","魏国的防具店老板"}),({"传风头巾","魏国的防具店老板"}),({"皮革鞋","赵国的饰品店老板"}),({"丝绸鞋","赵国的饰品店老板"}),({"青柳鞋","燕国的饰品店老板"}),({"碧龙鞋","燕国的饰品店老板"}),({"沙场鞋","周国的饰品店老板"}),({"狂战履","周国的饰品店老板"}),({"随风鞋","韩国的饰品店老板"}),({"天水鞋","韩国的饰品店老板"}),({"细麻鞋","秦国的饰品店老板"}),({"青龙鞋","秦国的饰品店老板"}),({"古藤鞋","齐国的饰品店老板"}),({"玉露鞋","齐国的饰品店老板"}),({"古甲鞋","魏国的饰品店老板"}),({"传风履","魏国的饰品店老板"}),({"皮革腰带","赵国的饰品店老板"}),({"丝绸腰带","赵国的饰品店老板"}),
	({"青柳腰带","燕国的饰品店老板"}),({"碧龙腰带","燕国的饰品店老板"}),({"沙场腰带","周国的饰品店老板"}),({"狂战腰带","周国的饰品店老板"}),({"随风腰带","韩国的饰品店老板"}),({"天水腰带","韩国的饰品店老板"}),({"细麻腰带","秦国的饰品店老板"}),({"青龙腰带","秦国的饰品店老板"}),({"古藤腰带","齐国的饰品店老板"}),({"玉露腰带","齐国的饰品店老板"}),({"古甲腰带","魏国的饰品店老板"}),({"传风腰带","魏国的饰品店老板"}),
   }),
4:({
	({"斩马刀","燕国的武器店老板"}),({"重翎枪","周国的武器店老板"}),({"迎风斩","燕国的武器店老板"}),({"驱魔棍","周国的武器店老板"}),({"精钢拳套","赵国的武器店老板"}),({"精钢镖","韩国的武器店老板"}),({"赤阳剑","齐国的武器店老板"}),({"朝阳剑","秦国的武器店老板"}),({"赤胆剑","魏国的武器店老板"}),({"绿青衣","赵国的防具店老板"}),({"绿青裙","赵国的防具店老板"}),({"舞天衣","燕国的防具店老板"}),({"舞天裙","燕国的防具店老板"}),({"破敌袍","周国的防具店老板"}),({"破敌素裙","周国的防具店老板"}),({"鲤鱼衣","韩国的防具店老板"}),({"鲤鱼裙","韩国的防具店老板"}),({"宣明袍","秦国的防具店老板"}),({"宣明素裙","秦国的防具店老板"}),({"唤云袍","齐国的防具店老板"}),({"唤云素裙","齐国的防具店老板"}),({"浑霜衣","魏国的防具店老板"}),({"浑霜裙","魏国的防具店老板"}),({"绿青帽","赵国的防具店老板"}),({"绿青头巾","赵国的防具店老板"}),({"舞天冠","燕国的防具店老板"}),({"舞天巾帽","燕国的防具店老板"}),({"破敌帽","周国的防具店老板"}),({"破敌头巾","周国的防具店老板"}),({"鲤鱼帽","韩国的防具店老板"}),
	({"鲤鱼头巾","韩国的防具店老板"}),({"宣明帽","秦国的防具店老板"}),({"宣明头巾","秦国的防具店老板"}),({"唤云帽","齐国的防具店老板"}),({"唤云头巾","齐国的防具店老板"}),({"浑霜冠","魏国的防具店老板"}),({"浑霜头巾","魏国的防具店老板"}),({"绿青鞋","赵国的饰品店老板"}),({"舞天履","燕国的饰品店老板",}),({"破敌鞋","周国的饰品店老板",}),({"鲤鱼鞋","韩国的饰品店老板",}),({"宣明鞋","秦国的饰品店老板",}),({"唤云鞋","齐国的饰品店老板",}),({"浑霜履","魏国的饰品店老板",}),({"绿青腰带","赵国的饰品店老板",}),({"舞天腰带","燕国的饰品店老板",}),({"破敌腰带","周国的饰品店老板",}),({"鲤鱼腰带","韩国的饰品店老板",}),({"宣明腰带","秦国的饰品店老板",}),({"唤云腰带","齐国的饰品店老板",}),({"浑霜腰带","魏国的饰品店老板",}),

   }),
]); 
//任务的概率
mapping mpTaskRate = 
([
	1 : ({0 ,5,5 ,40,10,40,0 ,0 ,0 ,0 ,0,0 ,0 }),
	2 : ({15,5,15,30,10,20,0 ,5 ,0 ,0 ,0,0 ,0 }),
	3 : ({15,5,5 ,20,10,25,0 ,10,10,0 ,0,0 ,0 }),
	4 : ({15,0,5 ,10,10,25,0 ,10,10,10,0,5 ,0 }),
	5 : ({10,0,10,0 ,10,20,0 ,10,10,10,0,10,10}),
	6 : ({0 ,0,0 ,0 ,10,20,0 ,15,15,20,0,10,10}),
	7 : ({0 ,0,0 ,0 ,10,20,0 ,15,15,20,0,10,10}),
	

]);
string get_random_quest4(int level)
{
	mapping quest = ([]);
	int i, ret, target;
	string name, result;
	level /= 10;
	if (level>12) level = 12;
	if (level<1) level = 1;
	i = random100();
	target = level;
	if (i<5) target -= 4;
	else
	if (i<15) target -= 3;
	else
	if (i<30) target -= 2;
	else
	if (i<50) target -= 1;
	if (target<1) target = level;
	name = sprintf("%d", target);
	i = sizeof(LevelTarget[name]);
	ret = LevelTarget[name][random(i)];
	if (ret<1000)
	        result = sprintf("/item/%d/%d", ret/10, (ret%10)*1000+ target * 10);
        else
                result = sprintf("/item/%d/%d", ret/100, ret);
	return result;
}

string get_random_quest1(int level)
{
	string name;
	if (level>114) level = 114;
        if (level<1) level = 1;
	name = sprintf("%d", level );
	if (LevelNpc[name]!=0) return LevelNpc[name];
	level --;
	while (level>=0)
	{
		name = sprintf("%d", level );
		if (LevelNpc[name]!=0) return LevelNpc[name];
		level --;
	}
	return "小山鸡";
}

string get_manager_name(string family)
{
        if (managername[family]!=0) return managername[family];
        else return "司库";
}

string *get_random_quest2(int level)
{
	string *result,name;
	int i;
	mapping mpTmp1;
	
	if ( level > 110 )
		level = 110;
	level /= 5;
	i = random100();
	if ( i < 15 && level >= 2 )
		level -= 2;
	else if ( i < 40 && level >= 1 )
		level -= 1;
	mpTmp1 = levelNPC1[level];
	if ( !mapp(mpTmp1) )
		return ({"小山鸡","在新手村可以捉到小山鸡"});
	result = keys(mpTmp1);
	if ( !arrayp(result) )
		return ({"小山鸡","在新手村可以捉到小山鸡"});
	name = result[random(sizeof(result))];
	return ({name,mpTmp1[name]});
}

string *get_random_quest3(int level)
{
	int i;
	mapping mpTmp;
	string *keys,name; 
	
	if ( level > 110 )
		level = 110;
	level /= 5;
	i = random100();
	if ( i < 20 && level > 3 )
		level -= 2 ;
	else if ( i < 45 && level > 2 )
		level -= 1 ;
	if ( level < 2 )
		level = 2;	
	mpTmp = LevelTarget1[level];
	if ( !mapp(mpTmp) )
		return ({"破损的头盔" , "在楚方城杀楚军刀兵可以得到破损的头盔"});
	keys = keys(mpTmp);
	name = keys[random(sizeof(keys))];	
	return ({name,mpTmp[name]});
}
//司库采购物品
string *get_random_siku(int iFlag)
{
	mixed *nTmp;
	if ( iFlag < 1 || iFlag > 4 )
		return ({"桔子","酒店老板"});
	nTmp = mpSiku[iFlag];
	return nTmp[random(sizeof(nTmp))];
}
//随机获取师门任务类别
int get_random_task(object player)
{
	int level, rate,i,size,type,*nRate;	
	level = player->get_level();
	if (level<10) level = 10;
	if (level>150) level = 150;
	switch ( level / 10 )
	{
	default:
	case 1..2:
		type = 1;
		break;			
	case 3..4:
		type = 2;					
		break;	
	case 5..6:
		type = 3;	
		break;							
	case 7..8:
		type = 4;						
		break;	
	case 9..10:
		type = 5;
		break;	
	case 11..12:
		type = 6;
		break;
	case 13..15:
		type = 7;
		break;	
	}
	rate = random100();
	nRate = mpTaskRate[type];
	for(i=0,size=sizeof(nRate);i<size;i++)
	{
		if ( rate < nRate[i] )
			break;
		rate -= nRate[i];	
	}
	type = i+1;		
	if ( type > 13 )
		type = 1;
	return type;
}
//随机取一个NPC
string *get_random_quest5(int level)
{
	string *result,name;
	int i;
	mapping mpTmp1;
	
	if ( level > 110 )
		level = 110;
	level /= 5;
	mpTmp1 = levelNPC1[level];
	if ( !mapp(mpTmp1) )
		return ({"小山鸡","在新手村可以捉到小山鸡"});
	result = keys(mpTmp1);
	if ( !arrayp(result) )
		return ({"小山鸡","在新手村可以捉到小山鸡"});
	name = result[random(sizeof(result))];
	return ({name,mpTmp1[name]});
}

//任务链收集师门物品
string *get_random_quest6(int level)
{
	int i;
	mapping mpTmp;
	string *keys,name; 
	
	if ( level > 110 )
		level = 110;
	level /= 5;
	level = level - (random(4)+1);
	mpTmp = LevelTarget1[level];
	if ( !mapp(mpTmp) )
		return ({"破损的头盔" , "在楚方城杀楚军刀兵可以得到破损的头盔"});
	keys = keys(mpTmp);
	name = keys[random(sizeof(keys))];	
	return ({name,mpTmp[name]});
}

int test100()
{
	int i,j,size,*nTmp,sum;
	
	for(i=1;i<8;i++)
	{
		nTmp = mpTaskRate[i];
		sum=0;
		for(j=0,size=sizeof(nTmp);j<size;j++)
		{
			sum += nTmp[j];	
		}
		if ( sum != 100)
			return i;
	}	
	return 0;
}