//数据由make/npc/makebeastinfo.c make/skill/makebeastskill.c 生成
mapping mpBeastInfo = ([ 
		"小山鸡" : (["level":0,"con":252,"str":576,"cps":563,"mp":164,"ma":226,"md":326,"dex":726,"att_spe":15,"walk_spe":3,"life":5000 ,"max_ski":3,"skill": ({74101,74109,}),"iLev":1,"cKind":"动物"]),
		"小野兔" : (["level":0,"con":252,"str":576,"cps":563,"mp":164,"ma":226,"md":326,"dex":726,"att_spe":15,"walk_spe":3,"life":5000 ,"max_ski":3,"skill": ({74103,74121,}),"iLev":1,"cKind":"动物"]),
		"小蜜蜂" : (["level":0,"con":268,"str":580,"cps":570,"mp":174,"ma":231,"md":331,"dex":731,"att_spe":15,"walk_spe":3,"life":5000 ,"max_ski":3,"skill": ({74123,74124,74137,}),"iLev":2,"cKind":"昆虫"]),
		"小蚂蚁" : (["level":0,"con":268,"str":580,"cps":570,"mp":174,"ma":231,"md":331,"dex":731,"att_spe":15,"walk_spe":3,"life":5000 ,"max_ski":3,"skill": ({74125,74128,74113,}),"iLev":2,"cKind":"昆虫"]),
		"斑点蛙" : (["level":0,"con":283,"str":584,"cps":577,"mp":184,"ma":237,"md":337,"dex":737,"att_spe":15,"walk_spe":3,"life":5000 ,"max_ski":3,"skill": ({74134,74119,74108,}),"iLev":3,"cKind":"动物"]),
		"赤褐蚁" : (["level":5,"con":329,"str":598,"cps":597,"mp":214,"ma":254,"md":354,"dex":754,"att_spe":15,"walk_spe":3,"life":5100 ,"max_ski":3,"skill": ({74125,74128,74109,}),"iLev":6,"cKind":"昆虫"]),
		"子母蛙" : (["level":5,"con":345,"str":602,"cps":603,"mp":224,"ma":260,"md":360,"dex":760,"att_spe":15,"walk_spe":3,"life":5100 ,"max_ski":3,"skill": ({74104,74134,74119,}),"iLev":7,"cKind":"动物"]),
		"楚军刀兵" : (["level":10,"con":406,"str":620,"cps":630,"mp":264,"ma":283,"md":383,"dex":783,"att_spe":15,"walk_spe":3,"life":5200 ,"max_ski":4,"skill": ({74101,74103,}),"iLev":11,"cKind":"人形"]),
		"楚军剑兵" : (["level":10,"con":406,"str":620,"cps":630,"mp":264,"ma":283,"md":383,"dex":783,"att_spe":15,"walk_spe":3,"life":5200 ,"max_ski":4,"skill": ({74116,74115,74114,}),"iLev":11,"cKind":"人形"]),
		"斑点狗" : (["level":10,"con":406,"str":620,"cps":630,"mp":264,"ma":283,"md":383,"dex":783,"att_spe":15,"walk_spe":3,"life":5200 ,"max_ski":4,"skill": ({74125,74122,}),"iLev":11,"cKind":"动物"]),
		"四脚蛇" : (["level":10,"con":406,"str":620,"cps":630,"mp":264,"ma":283,"md":383,"dex":783,"att_spe":15,"walk_spe":3,"life":5200 ,"max_ski":4,"skill": ({74139,74120,}),"iLev":11,"cKind":"动物"]),
		"独角仙" : (["level":10,"con":406,"str":620,"cps":630,"mp":264,"ma":283,"md":383,"dex":783,"att_spe":15,"walk_spe":3,"life":5200 ,"max_ski":4,"skill": ({74133,74118,}),"iLev":11,"cKind":"昆虫"]),
		"刺尾蜂" : (["level":10,"con":406,"str":620,"cps":630,"mp":264,"ma":283,"md":383,"dex":783,"att_spe":15,"walk_spe":3,"life":5200 ,"max_ski":4,"skill": ({74106,74115,74114,}),"iLev":11,"cKind":"昆虫"]),
		"棕熊" : (["level":10,"con":422,"str":624,"cps":637,"mp":274,"ma":289,"md":389,"dex":789,"att_spe":15,"walk_spe":3,"life":5200 ,"max_ski":4,"skill": ({74101,74119,74121,}),"iLev":12,"cKind":"动物"]),
		"狒狒" : (["level":10,"con":422,"str":624,"cps":637,"mp":274,"ma":289,"md":389,"dex":789,"att_spe":15,"walk_spe":3,"life":5200 ,"max_ski":4,"skill": ({74102,74118,74121,}),"iLev":12,"cKind":"动物"]),
		"绿臂螳螂" : (["level":10,"con":422,"str":624,"cps":637,"mp":274,"ma":289,"md":389,"dex":789,"att_spe":15,"walk_spe":3,"life":5200 ,"max_ski":4,"skill": ({74129,74130,}),"iLev":12,"cKind":"昆虫"]),
		"独眼兽" : (["level":15,"con":483,"str":642,"cps":663,"mp":314,"ma":311,"md":411,"dex":811,"att_spe":15,"walk_spe":3,"life":5300 ,"max_ski":4,"skill": ({74135,74131,74120,}),"iLev":16,"cKind":"动物"]),
		"地痞" : (["level":15,"con":498,"str":647,"cps":670,"mp":324,"ma":317,"md":417,"dex":817,"att_spe":15,"walk_spe":3,"life":5300 ,"max_ski":4,"skill": ({74107,74127,74126,}),"iLev":17,"cKind":"人形"]),
		"打手" : (["level":15,"con":498,"str":647,"cps":670,"mp":324,"ma":317,"md":417,"dex":817,"att_spe":15,"walk_spe":3,"life":5300 ,"max_ski":4,"skill": ({74122,74112,74124,}),"iLev":17,"cKind":"人形"]),
		"鬼火" : (["level":20,"con":560,"str":664,"cps":697,"mp":364,"ma":340,"md":440,"dex":840,"att_spe":15,"walk_spe":3,"life":5400 ,"max_ski":4,"skill": ({74118,74133,}),"iLev":21,"cKind":"亡灵"]),
		"幽灵" : (["level":20,"con":560,"str":664,"cps":697,"mp":364,"ma":340,"md":440,"dex":840,"att_spe":15,"walk_spe":3,"life":5400 ,"max_ski":4,"skill": ({74132,74117,74105,}),"iLev":21,"cKind":"亡灵"]),
		"飞贼" : (["level":20,"con":560,"str":664,"cps":697,"mp":364,"ma":340,"md":440,"dex":840,"att_spe":15,"walk_spe":3,"life":5400 ,"max_ski":4,"skill": ({74108,74132,74117,}),"iLev":21,"cKind":"人形"]),
		"恶老头" : (["level":20,"con":575,"str":669,"cps":703,"mp":374,"ma":346,"md":446,"dex":846,"att_spe":15,"walk_spe":3,"life":5400 ,"max_ski":4,"skill": ({74123,74121,74139,}),"iLev":22,"cKind":"人形"]),
		"恶屠" : (["level":20,"con":575,"str":669,"cps":703,"mp":374,"ma":346,"md":446,"dex":846,"att_spe":15,"walk_spe":3,"life":5400 ,"max_ski":4,"skill": ({74107,74116,74126,}),"iLev":22,"cKind":"人形"]),
		"狂徒" : (["level":20,"con":575,"str":669,"cps":703,"mp":374,"ma":346,"md":446,"dex":846,"att_spe":15,"walk_spe":3,"life":5400 ,"max_ski":4,"skill": ({74129,74128,74121,}),"iLev":22,"cKind":"人形"]),
		"巡城小兵" : (["level":25,"con":622,"str":682,"cps":723,"mp":404,"ma":363,"md":463,"dex":863,"att_spe":15,"walk_spe":3,"life":5500 ,"max_ski":4,"skill": ({74101,74106,74109,}),"iLev":25,"cKind":"人形"]),
		"斥候" : (["level":25,"con":622,"str":682,"cps":723,"mp":404,"ma":363,"md":463,"dex":863,"att_spe":15,"walk_spe":3,"life":5500 ,"max_ski":4,"skill": ({74113,74124,74123,}),"iLev":25,"cKind":"人形"]),
		"土匪" : (["level":25,"con":637,"str":687,"cps":730,"mp":414,"ma":369,"md":469,"dex":869,"att_spe":15,"walk_spe":3,"life":5500 ,"max_ski":4,"skill": ({74138,74128,74120,}),"iLev":26,"cKind":"人形"]),
		"草寇" : (["level":25,"con":637,"str":687,"cps":730,"mp":414,"ma":369,"md":469,"dex":869,"att_spe":15,"walk_spe":3,"life":5500 ,"max_ski":4,"skill": ({74111,74132,74117,}),"iLev":26,"cKind":"人形"]),
		"赵国巡逻兵" : (["level":25,"con":652,"str":691,"cps":737,"mp":424,"ma":374,"md":474,"dex":874,"att_spe":15,"walk_spe":3,"life":5500 ,"max_ski":4,"skill": ({74101,74103,74121,}),"iLev":27,"cKind":"人形"]),
		"燕国巡逻兵" : (["level":25,"con":652,"str":691,"cps":737,"mp":424,"ma":374,"md":474,"dex":874,"att_spe":15,"walk_spe":3,"life":5500 ,"max_ski":4,"skill": ({74102,74111,}),"iLev":27,"cKind":"人形"]),
		"马贼" : (["level":25,"con":652,"str":691,"cps":737,"mp":424,"ma":374,"md":474,"dex":874,"att_spe":15,"walk_spe":3,"life":5500 ,"max_ski":4,"skill": ({74106,74120,74114,}),"iLev":27,"cKind":"人形"]),
		"秦国守军" : (["level":25,"con":652,"str":691,"cps":737,"mp":424,"ma":374,"md":474,"dex":874,"att_spe":15,"walk_spe":3,"life":5500 ,"max_ski":4,"skill": ({74101,74103,74104,}),"iLev":27,"cKind":"人形"]),
		"秦弓箭手" : (["level":25,"con":652,"str":691,"cps":737,"mp":424,"ma":374,"md":474,"dex":874,"att_spe":15,"walk_spe":3,"life":5500 ,"max_ski":4,"skill": ({74116,74117,74112,}),"iLev":27,"cKind":"人形"]),
		"鬼魅" : (["level":25,"con":668,"str":696,"cps":743,"mp":434,"ma":380,"md":480,"dex":880,"att_spe":15,"walk_spe":3,"life":5500 ,"max_ski":5,"skill": ({74118,74133,74126,}),"iLev":28,"cKind":"亡灵"]),
		"骷髅兵" : (["level":25,"con":668,"str":696,"cps":743,"mp":434,"ma":380,"md":480,"dex":880,"att_spe":15,"walk_spe":3,"life":5500 ,"max_ski":5,"skill": ({74110,74102,74124,}),"iLev":28,"cKind":"亡灵"]),
		"褐尾蝎" : (["level":30,"con":714,"str":709,"cps":763,"mp":464,"ma":397,"md":497,"dex":897,"att_spe":15,"walk_spe":3,"life":5600 ,"max_ski":5,"skill": ({74140,74116,74205,}),"iLev":31,"cKind":"昆虫"]),
		"蛛蛛怪" : (["level":30,"con":714,"str":709,"cps":763,"mp":464,"ma":397,"md":497,"dex":897,"att_spe":15,"walk_spe":3,"life":5600 ,"max_ski":5,"skill": ({74116,74103,}),"iLev":31,"cKind":"昆虫"]),
		"毒刺蜂" : (["level":30,"con":714,"str":709,"cps":763,"mp":464,"ma":397,"md":497,"dex":897,"att_spe":15,"walk_spe":3,"life":5600 ,"max_ski":5,"skill": ({74116,74123,}),"iLev":31,"cKind":"昆虫"]),
		"牛头怪" : (["level":30,"con":729,"str":713,"cps":770,"mp":474,"ma":403,"md":503,"dex":903,"att_spe":15,"walk_spe":3,"life":5600 ,"max_ski":5,"skill": ({74112,74111,74113,}),"iLev":32,"cKind":"妖"]),
		"狼妖" : (["level":30,"con":729,"str":713,"cps":770,"mp":474,"ma":403,"md":503,"dex":903,"att_spe":15,"walk_spe":3,"life":5600 ,"max_ski":5,"skill": ({74109,74121,74125,}),"iLev":32,"cKind":"妖"]),
		"猪妖" : (["level":30,"con":729,"str":713,"cps":770,"mp":474,"ma":403,"md":503,"dex":903,"att_spe":15,"walk_spe":3,"life":5600 ,"max_ski":5,"skill": ({74122,74101,74112,}),"iLev":32,"cKind":"妖"]),
		"豺狗" : (["level":30,"con":729,"str":713,"cps":770,"mp":474,"ma":403,"md":503,"dex":903,"att_spe":15,"walk_spe":3,"life":5600 ,"max_ski":5,"skill": ({74110,74102,74125,}),"iLev":32,"cKind":"妖"]),
		"水贼" : (["level":35,"con":791,"str":731,"cps":797,"mp":514,"ma":426,"md":526,"dex":926,"att_spe":15,"walk_spe":3,"life":5700 ,"max_ski":5,"skill": ({74119,74134,}),"iLev":36,"cKind":"人形"]),
		"癞蛤蟆" : (["level":35,"con":791,"str":731,"cps":797,"mp":514,"ma":426,"md":526,"dex":926,"att_spe":15,"walk_spe":3,"life":5700 ,"max_ski":5,"skill": ({74140,74134,74124,}),"iLev":36,"cKind":"动物"]),
		"黑熊" : (["level":35,"con":791,"str":731,"cps":797,"mp":514,"ma":426,"md":526,"dex":926,"att_spe":15,"walk_spe":3,"life":5700 ,"max_ski":5,"skill": ({74101,74114,74125,}),"iLev":36,"cKind":"动物"]),
		"赤炎蛇" : (["level":35,"con":791,"str":731,"cps":797,"mp":514,"ma":426,"md":526,"dex":926,"att_spe":15,"walk_spe":3,"life":5700 ,"max_ski":5,"skill": ({74107,74117,}),"iLev":36,"cKind":"动物"]),
		"螳螂妖" : (["level":35,"con":791,"str":731,"cps":797,"mp":514,"ma":426,"md":526,"dex":926,"att_spe":15,"walk_spe":3,"life":5700 ,"max_ski":5,"skill": ({74111,74117,74120,}),"iLev":36,"cKind":"妖"]),
		"虾兵" : (["level":40,"con":868,"str":753,"cps":830,"mp":564,"ma":454,"md":554,"dex":954,"att_spe":15,"walk_spe":3,"life":5800 ,"max_ski":5,"skill": ({74119,74134,74124,}),"iLev":41,"cKind":"妖"]),
		"蟹将" : (["level":40,"con":868,"str":753,"cps":830,"mp":564,"ma":454,"md":554,"dex":954,"att_spe":15,"walk_spe":3,"life":5800 ,"max_ski":5,"skill": ({74117,74132,74124,}),"iLev":41,"cKind":"妖"]),
		"弩兵" : (["level":45,"con":929,"str":771,"cps":857,"mp":604,"ma":477,"md":577,"dex":977,"att_spe":15,"walk_spe":3,"life":5900 ,"max_ski":5,"skill": ({74123,74101,74114,74121,}),"iLev":45,"cKind":"人形"]),
		"拳法师" : (["level":45,"con":929,"str":771,"cps":857,"mp":604,"ma":477,"md":577,"dex":977,"att_spe":15,"walk_spe":3,"life":5900 ,"max_ski":5,"skill": ({74123,74102,74114,74113,}),"iLev":45,"cKind":"人形"]),
		"棍师" : (["level":45,"con":929,"str":771,"cps":857,"mp":604,"ma":477,"md":577,"dex":977,"att_spe":15,"walk_spe":3,"life":5900 ,"max_ski":5,"skill": ({74123,74103,74122,74116,}),"iLev":45,"cKind":"人形"]),
		"壮丁" : (["level":45,"con":945,"str":776,"cps":863,"mp":614,"ma":483,"md":583,"dex":983,"att_spe":15,"walk_spe":3,"life":5900 ,"max_ski":5,"skill": ({74105,74109,}),"iLev":46,"cKind":"人形"]),
		"苦役" : (["level":45,"con":945,"str":776,"cps":863,"mp":614,"ma":483,"md":583,"dex":983,"att_spe":15,"walk_spe":3,"life":5900 ,"max_ski":5,"skill": ({74107,74103,74102,}),"iLev":46,"cKind":"人形"]),
		"劳役" : (["level":45,"con":945,"str":776,"cps":863,"mp":614,"ma":483,"md":583,"dex":983,"att_spe":15,"walk_spe":3,"life":5900 ,"max_ski":5,"skill": ({74109,74113,74125,}),"iLev":46,"cKind":"人形"]),
		"火葫芦" : (["level":50,"con":1006,"str":793,"cps":890,"mp":654,"ma":506,"md":606,"dex":1006,"att_spe":15,"walk_spe":3,"life":6000 ,"max_ski":5,"skill": ({74123,74101,74114,74130,}),"iLev":50,"cKind":"人形"]),
		"铁胖" : (["level":50,"con":1006,"str":793,"cps":890,"mp":654,"ma":506,"md":606,"dex":1006,"att_spe":15,"walk_spe":3,"life":6000 ,"max_ski":5,"skill": ({74123,74102,74114,74113,}),"iLev":50,"cKind":"人形"]),
		"飞镖客" : (["level":50,"con":1006,"str":793,"cps":890,"mp":654,"ma":506,"md":606,"dex":1006,"att_spe":15,"walk_spe":3,"life":6000 ,"max_ski":5,"skill": ({74214,74103,74122,74116,}),"iLev":50,"cKind":"人形"]),
		"绿壳蜘蛛" : (["level":50,"con":1022,"str":798,"cps":897,"mp":664,"ma":511,"md":611,"dex":1011,"att_spe":15,"walk_spe":3,"life":6000 ,"max_ski":5,"skill": ({74110,74130,74114,}),"iLev":51,"cKind":"昆虫"]),
		"大笨熊" : (["level":50,"con":1022,"str":798,"cps":897,"mp":664,"ma":511,"md":611,"dex":1011,"att_spe":15,"walk_spe":3,"life":6000 ,"max_ski":5,"skill": ({74101,74104,74114,}),"iLev":51,"cKind":"动物"]),
		"魍魉" : (["level":50,"con":1022,"str":798,"cps":897,"mp":664,"ma":511,"md":611,"dex":1011,"att_spe":15,"walk_spe":3,"life":6000 ,"max_ski":5,"skill": ({74118,74133,}),"iLev":51,"cKind":"亡灵"]),
		"花豹精" : (["level":50,"con":1022,"str":798,"cps":897,"mp":664,"ma":511,"md":611,"dex":1011,"att_spe":15,"walk_spe":3,"life":6000 ,"max_ski":5,"skill": ({74121,74111,74110,}),"iLev":51,"cKind":"妖"]),
		"豺狼" : (["level":50,"con":1022,"str":798,"cps":897,"mp":664,"ma":511,"md":611,"dex":1011,"att_spe":15,"walk_spe":3,"life":6000 ,"max_ski":5,"skill": ({74114,74125,74216,}),"iLev":51,"cKind":"妖"]),
		"东胡弓骑兵" : (["level":55,"con":1083,"str":816,"cps":923,"mp":704,"ma":534,"md":634,"dex":1034,"att_spe":15,"walk_spe":3,"life":6100 ,"max_ski":5,"skill": ({74214,74102,74114,74113,}),"iLev":55,"cKind":"人形"]),
		"东胡骑兵" : (["level":55,"con":1083,"str":816,"cps":923,"mp":704,"ma":534,"md":634,"dex":1034,"att_spe":15,"walk_spe":3,"life":6100 ,"max_ski":5,"skill": ({74214,74103,74122,74116,}),"iLev":55,"cKind":"人形"]),
//		"东海龙虾" : (["level":55,"con":1083,"str":816,"cps":923,"mp":704,"ma":534,"md":634,"dex":1034,"att_spe":15,"walk_spe":3,"life":6100 ,"max_ski":5,"skill": ({74119,74134,74122,74201,}),"iLev":55,"cKind":"动物"]),
//		"大闸蟹" : (["level":55,"con":1083,"str":816,"cps":923,"mp":704,"ma":534,"md":634,"dex":1034,"att_spe":15,"walk_spe":3,"life":6100 ,"max_ski":5,"skill": ({74228,74134,74122,74201,}),"iLev":55,"cKind":"动物"]),
		"燕国刀盾兵" : (["level":55,"con":1098,"str":820,"cps":930,"mp":714,"ma":540,"md":640,"dex":1040,"att_spe":15,"walk_spe":3,"life":6100 ,"max_ski":5,"skill": ({74101,74116,74117,}),"iLev":56,"cKind":"人形"]),
		"燕国剑盾兵" : (["level":55,"con":1098,"str":820,"cps":930,"mp":714,"ma":540,"md":640,"dex":1040,"att_spe":15,"walk_spe":3,"life":6100 ,"max_ski":5,"skill": ({74101,74113,}),"iLev":56,"cKind":"人形"]),
		"燕国枪兵" : (["level":55,"con":1098,"str":820,"cps":930,"mp":714,"ma":540,"md":640,"dex":1040,"att_spe":15,"walk_spe":3,"life":6100 ,"max_ski":5,"skill": ({74112,74103,74106,}),"iLev":56,"cKind":"人形"]),
		"匈奴弓骑兵" : (["level":60,"con":1160,"str":838,"cps":957,"mp":754,"ma":563,"md":663,"dex":1063,"att_spe":15,"walk_spe":3,"life":6200 ,"max_ski":5,"skill": ({74123,74202,74114,74113,}),"iLev":60,"cKind":"人形"]),
		"匈奴骑兵" : (["level":60,"con":1160,"str":838,"cps":957,"mp":754,"ma":563,"md":663,"dex":1063,"att_spe":15,"walk_spe":3,"life":6200 ,"max_ski":5,"skill": ({74123,74201,74114,74130,}),"iLev":60,"cKind":"人形"]),
//		"地狱猎豹" : (["level":60,"con":1160,"str":838,"cps":957,"mp":754,"ma":563,"md":663,"dex":1063,"att_spe":15,"walk_spe":3,"life":6200 ,"max_ski":5,"skill": ({74214,74101,74205,74130,}),"iLev":60,"cKind":"动物"]),
		"赵国刀盾兵" : (["level":60,"con":1191,"str":847,"cps":970,"mp":774,"ma":574,"md":674,"dex":1074,"att_spe":15,"walk_spe":3,"life":6200 ,"max_ski":5,"skill": ({74114,74125,74216,}),"iLev":62,"cKind":"人形"]),
		"赵国剑盾兵" : (["level":60,"con":1191,"str":847,"cps":970,"mp":774,"ma":574,"md":674,"dex":1074,"att_spe":15,"walk_spe":3,"life":6200 ,"max_ski":5,"skill": ({74118,74109,74113,}),"iLev":62,"cKind":"人形"]),
		"赵国弓兵" : (["level":60,"con":1191,"str":847,"cps":970,"mp":774,"ma":574,"md":674,"dex":1074,"att_spe":15,"walk_spe":3,"life":6200 ,"max_ski":5,"skill": ({74107,74101,74111,}),"iLev":62,"cKind":"人形"]),
		"逃囚" : (["level":65,"con":1237,"str":860,"cps":990,"mp":804,"ma":591,"md":691,"dex":1091,"att_spe":15,"walk_spe":3,"life":6300 ,"max_ski":5,"skill": ({74123,74202,74114,74113,}),"iLev":65,"cKind":"人形"]),
		"铁锤王" : (["level":65,"con":1237,"str":860,"cps":990,"mp":804,"ma":591,"md":691,"dex":1091,"att_spe":15,"walk_spe":3,"life":6300 ,"max_ski":5,"skill": ({74123,74103,74213,74116,}),"iLev":65,"cKind":"人形"]),
		"邪道士" : (["level":65,"con":1237,"str":860,"cps":990,"mp":804,"ma":591,"md":691,"dex":1091,"att_spe":15,"walk_spe":3,"life":6300 ,"max_ski":5,"skill": ({74123,74102,74114,74204,}),"iLev":65,"cKind":"人形"]),
//		"天外幻猪" : (["level":65,"con":1237,"str":860,"cps":990,"mp":804,"ma":591,"md":691,"dex":1091,"att_spe":15,"walk_spe":3,"life":6300 ,"max_ski":5,"skill": ({74214,74112,74103,74213,74114,}),"iLev":65,"cKind":"动物"]),
//		"天外幻熊" : (["level":65,"con":1237,"str":860,"cps":990,"mp":804,"ma":591,"md":691,"dex":1091,"att_spe":15,"walk_spe":3,"life":6300 ,"max_ski":5,"skill": ({74214,74122,74103,74113,}),"iLev":65,"cKind":"动物"]),
		"秦国刀盾兵" : (["level":65,"con":1252,"str":864,"cps":997,"mp":814,"ma":597,"md":697,"dex":1097,"att_spe":15,"walk_spe":3,"life":6300 ,"max_ski":5,"skill": ({74211,74121,74125,}),"iLev":66,"cKind":"人形"]),
		"秦国枪兵" : (["level":65,"con":1252,"str":864,"cps":997,"mp":814,"ma":597,"md":697,"dex":1097,"att_spe":15,"walk_spe":3,"life":6300 ,"max_ski":5,"skill": ({74101,74121,74104,}),"iLev":66,"cKind":"人形"]),
		"秦国弓兵" : (["level":65,"con":1252,"str":864,"cps":997,"mp":814,"ma":597,"md":697,"dex":1097,"att_spe":15,"walk_spe":3,"life":6300 ,"max_ski":5,"skill": ({74116,74112,74110,}),"iLev":66,"cKind":"人形"]),
		"花面斧" : (["level":70,"con":1314,"str":882,"cps":1023,"mp":854,"ma":620,"md":720,"dex":1120,"att_spe":15,"walk_spe":3,"life":6400 ,"max_ski":5,"skill": ({74207,74112,74110,74101,}),"iLev":70,"cKind":"人形"]),
		"黄袍妖道" : (["level":70,"con":1314,"str":882,"cps":1023,"mp":854,"ma":620,"md":720,"dex":1120,"att_spe":15,"walk_spe":3,"life":6400 ,"max_ski":5,"skill": ({74123,74109,74122,74201,}),"iLev":70,"cKind":"人形"]),
//		"巨型螳螂妖" : (["level":70,"con":1314,"str":882,"cps":1023,"mp":854,"ma":620,"md":720,"dex":1120,"att_spe":15,"walk_spe":3,"life":6400 ,"max_ski":5,"skill": ({74123,74103,74213,74116,}),"iLev":70,"cKind":"昆虫"]),
		"劫匪" : (["level":70,"con":1345,"str":891,"cps":1037,"mp":874,"ma":631,"md":731,"dex":1131,"att_spe":15,"walk_spe":3,"life":6400 ,"max_ski":5,"skill": ({74106,74113,74101,}),"iLev":72,"cKind":"人形"]),
		"密探" : (["level":70,"con":1345,"str":891,"cps":1037,"mp":874,"ma":631,"md":731,"dex":1131,"att_spe":15,"walk_spe":3,"life":6400 ,"max_ski":5,"skill": ({74109,74122,74101,}),"iLev":72,"cKind":"人形"]),
		"水鬼" : (["level":70,"con":1345,"str":891,"cps":1037,"mp":874,"ma":631,"md":731,"dex":1131,"att_spe":15,"walk_spe":3,"life":6400 ,"max_ski":5,"skill": ({74119,74134,74124,}),"iLev":72,"cKind":"人形"]),
		"绿剑郎君" : (["level":75,"con":1391,"str":904,"cps":1057,"mp":904,"ma":649,"md":749,"dex":1149,"att_spe":15,"walk_spe":3,"life":6500 ,"max_ski":5,"skill": ({74123,74202,74114,74113,}),"iLev":75,"cKind":"人形"]),
		"关刀客" : (["level":75,"con":1391,"str":904,"cps":1057,"mp":904,"ma":649,"md":749,"dex":1149,"att_spe":15,"walk_spe":3,"life":6500 ,"max_ski":5,"skill": ({74123,74103,74213,74116,}),"iLev":75,"cKind":"人形"]),
//		"幻境守卫" : (["level":75,"con":1391,"str":904,"cps":1057,"mp":904,"ma":649,"md":749,"dex":1149,"att_spe":15,"walk_spe":3,"life":6500 ,"max_ski":5,"skill": ({74123,74102,74114,74204,}),"iLev":75,"cKind":"人形"]),
		"罐中妖" : (["level":75,"con":1406,"str":909,"cps":1063,"mp":914,"ma":654,"md":754,"dex":1154,"att_spe":15,"walk_spe":3,"life":6500 ,"max_ski":5,"skill": ({74132,74117,74106,}),"iLev":76,"cKind":"妖"]),
		"豆兵" : (["level":75,"con":1406,"str":909,"cps":1063,"mp":914,"ma":654,"md":754,"dex":1154,"att_spe":15,"walk_spe":3,"life":6500 ,"max_ski":5,"skill": ({74105,74101,74121,}),"iLev":76,"cKind":"妖"]),
		"冤魂" : (["level":75,"con":1422,"str":913,"cps":1070,"mp":924,"ma":660,"md":760,"dex":1160,"att_spe":15,"walk_spe":3,"life":6500 ,"max_ski":5,"skill": ({74104,74108,74101,}),"iLev":77,"cKind":"亡灵"]),
		"魍魉鬼" : (["level":75,"con":1422,"str":913,"cps":1070,"mp":924,"ma":660,"md":760,"dex":1160,"att_spe":15,"walk_spe":3,"life":6500 ,"max_ski":5,"skill": ({74118,74133,74115,}),"iLev":77,"cKind":"亡灵"]),
		"疫鬼" : (["level":75,"con":1437,"str":918,"cps":1077,"mp":934,"ma":666,"md":766,"dex":1166,"att_spe":15,"walk_spe":3,"life":6500 ,"max_ski":5,"skill": ({74124,74110,}),"iLev":78,"cKind":"亡灵"]),
		"恶灵" : (["level":75,"con":1437,"str":918,"cps":1077,"mp":934,"ma":666,"md":766,"dex":1166,"att_spe":15,"walk_spe":3,"life":6500 ,"max_ski":5,"skill": ({74101,74116,74112,}),"iLev":78,"cKind":"亡灵"]),
		"雷葫芦" : (["level":80,"con":1468,"str":927,"cps":1090,"mp":954,"ma":677,"md":777,"dex":1177,"att_spe":15,"walk_spe":3,"life":6600 ,"max_ski":5,"skill": ({74132,74117,74122,74201,}),"iLev":80,"cKind":"人形"]),
		"蒙面拳盗" : (["level":80,"con":1468,"str":927,"cps":1090,"mp":954,"ma":677,"md":777,"dex":1177,"att_spe":15,"walk_spe":3,"life":6600 ,"max_ski":5,"skill": ({74123,74202,74114,74113,}),"iLev":80,"cKind":"人形"]),
//		"地狱罐妖" : (["level":80,"con":1468,"str":927,"cps":1090,"mp":954,"ma":677,"md":777,"dex":1177,"att_spe":15,"walk_spe":3,"life":6600 ,"max_ski":5,"skill": ({74214,74122,74103,74113,}),"iLev":80,"cKind":"亡灵"]),
		"铜甲尸" : (["level":80,"con":1483,"str":931,"cps":1097,"mp":964,"ma":683,"md":783,"dex":1183,"att_spe":15,"walk_spe":3,"life":6600 ,"max_ski":5,"skill": ({74101,74113,74125,}),"iLev":81,"cKind":"亡灵"]),
		"侍卫亡灵" : (["level":80,"con":1483,"str":931,"cps":1097,"mp":964,"ma":683,"md":783,"dex":1183,"att_spe":15,"walk_spe":3,"life":6600 ,"max_ski":5,"skill": ({74135,74131,74120,}),"iLev":81,"cKind":"亡灵"]),
		"铁甲尸" : (["level":80,"con":1498,"str":936,"cps":1103,"mp":974,"ma":689,"md":789,"dex":1189,"att_spe":15,"walk_spe":3,"life":6600 ,"max_ski":5,"skill": ({74101,74113,74124,}),"iLev":82,"cKind":"亡灵"]),
		"刀盾骷髅" : (["level":80,"con":1514,"str":940,"cps":1110,"mp":984,"ma":694,"md":794,"dex":1194,"att_spe":15,"walk_spe":3,"life":6600 ,"max_ski":5,"skill": ({74114,74125,74105,}),"iLev":83,"cKind":"亡灵"]),
		"剑盾骷髅" : (["level":80,"con":1514,"str":940,"cps":1110,"mp":984,"ma":694,"md":794,"dex":1194,"att_spe":15,"walk_spe":3,"life":6600 ,"max_ski":5,"skill": ({74109,74122,74114,}),"iLev":83,"cKind":"亡灵"]),
		"双刀骷髅" : (["level":80,"con":1514,"str":940,"cps":1110,"mp":984,"ma":694,"md":794,"dex":1194,"att_spe":15,"walk_spe":3,"life":6600 ,"max_ski":5,"skill": ({74106,74122,74121,}),"iLev":83,"cKind":"亡灵"]),
		"僵尸" : (["level":80,"con":1529,"str":944,"cps":1117,"mp":994,"ma":700,"md":800,"dex":1200,"att_spe":15,"walk_spe":3,"life":6600 ,"max_ski":5,"skill": ({74122,74124,}),"iLev":84,"cKind":"亡灵"]),
		"石狮" : (["level":85,"con":1545,"str":949,"cps":1123,"mp":1004,"ma":706,"md":806,"dex":1206,"att_spe":15,"walk_spe":3,"life":6700 ,"max_ski":5,"skill": ({74108,74101,}),"iLev":85,"cKind":"无"]),
		"石虎" : (["level":85,"con":1545,"str":949,"cps":1123,"mp":1004,"ma":706,"md":806,"dex":1206,"att_spe":15,"walk_spe":3,"life":6700 ,"max_ski":5,"skill": ({74112,74110,}),"iLev":85,"cKind":"无"]),
		"伏路贼" : (["level":85,"con":1545,"str":949,"cps":1123,"mp":1004,"ma":706,"md":806,"dex":1206,"att_spe":15,"walk_spe":3,"life":6700 ,"max_ski":5,"skill": ({74123,74101,74114,74130,}),"iLev":85,"cKind":"人形"]),
		"铁辫王" : (["level":85,"con":1545,"str":949,"cps":1123,"mp":1004,"ma":706,"md":806,"dex":1206,"att_spe":15,"walk_spe":3,"life":6700 ,"max_ski":5,"skill": ({74123,74102,74114,74113,}),"iLev":85,"cKind":"人形"]),
//		"黄金狮" : (["level":85,"con":1545,"str":949,"cps":1123,"mp":1004,"ma":706,"md":806,"dex":1206,"att_spe":15,"walk_spe":3,"life":6700 ,"max_ski":5,"skill": ({74214,74103,74122,74116,}),"iLev":85,"cKind":"无"]),
//		"赤金魔虎" : (["level":85,"con":1545,"str":949,"cps":1123,"mp":1004,"ma":706,"md":806,"dex":1206,"att_spe":15,"walk_spe":3,"life":6700 ,"max_ski":5,"skill": ({74214,74122,74103,74113,}),"iLev":85,"cKind":"无"]),
		"刀俑" : (["level":85,"con":1560,"str":953,"cps":1130,"mp":1014,"ma":711,"md":811,"dex":1211,"att_spe":15,"walk_spe":3,"life":6700 ,"max_ski":5,"skill": ({74109,74122,74114,}),"iLev":86,"cKind":"无"]),
		"弓箭石俑" : (["level":85,"con":1575,"str":958,"cps":1137,"mp":1024,"ma":717,"md":817,"dex":1217,"att_spe":15,"walk_spe":3,"life":6700 ,"max_ski":5,"skill": ({74116,74124,74110,}),"iLev":87,"cKind":"无"]),
		"枪俑" : (["level":85,"con":1591,"str":962,"cps":1143,"mp":1034,"ma":723,"md":823,"dex":1223,"att_spe":15,"walk_spe":3,"life":6700 ,"max_ski":5,"skill": ({74107,74112,74110,}),"iLev":88,"cKind":"无"]),
		"剑俑" : (["level":85,"con":1606,"str":967,"cps":1150,"mp":1044,"ma":729,"md":829,"dex":1229,"att_spe":15,"walk_spe":3,"life":6700 ,"max_ski":5,"skill": ({74107,74113,74101,}),"iLev":89,"cKind":"无"]),
		"阴阳剑" : (["level":90,"con":1622,"str":971,"cps":1157,"mp":1054,"ma":734,"md":834,"dex":1234,"att_spe":15,"walk_spe":3,"life":6800 ,"max_ski":5,"skill": ({74123,74201,74114,74130,}),"iLev":90,"cKind":"人形"]),
		"水火棍" : (["level":90,"con":1622,"str":971,"cps":1157,"mp":1054,"ma":734,"md":834,"dex":1234,"att_spe":15,"walk_spe":3,"life":6800 ,"max_ski":5,"skill": ({74118,74133,74122,74201,}),"iLev":90,"cKind":"人形"]),
//		"绿荧鬼" : (["level":90,"con":1622,"str":971,"cps":1157,"mp":1054,"ma":734,"md":834,"dex":1234,"att_spe":15,"walk_spe":3,"life":6800 ,"max_ski":5,"skill": ({74107,74113,74201,74214,}),"iLev":90,"cKind":"亡灵"]),
		"骷髅妖" : (["level":90,"con":1637,"str":976,"cps":1163,"mp":1064,"ma":740,"md":840,"dex":1240,"att_spe":15,"walk_spe":3,"life":6800 ,"max_ski":5,"skill": ({74104,74108,74107,}),"iLev":91,"cKind":"亡灵"]),
		"骸骨精" : (["level":90,"con":1637,"str":976,"cps":1163,"mp":1064,"ma":740,"md":840,"dex":1240,"att_spe":15,"walk_spe":3,"life":6800 ,"max_ski":5,"skill": ({74110,74130,74114,}),"iLev":91,"cKind":"亡灵"]),
		"邪灵" : (["level":90,"con":1637,"str":976,"cps":1163,"mp":1064,"ma":740,"md":840,"dex":1240,"att_spe":15,"walk_spe":3,"life":6800 ,"max_ski":5,"skill": ({74134,74119,74228,}),"iLev":91,"cKind":"亡灵"]),
		"尸魔" : (["level":90,"con":1652,"str":980,"cps":1170,"mp":1074,"ma":746,"md":846,"dex":1246,"att_spe":15,"walk_spe":3,"life":6800 ,"max_ski":5,"skill": ({74132,74117,74226,}),"iLev":92,"cKind":"亡灵"]),
		"怨灵" : (["level":90,"con":1668,"str":984,"cps":1177,"mp":1084,"ma":751,"md":851,"dex":1251,"att_spe":15,"walk_spe":3,"life":6800 ,"max_ski":5,"skill": ({74135,74120,74229,}),"iLev":93,"cKind":"亡灵"]),
		"风雷剑" : (["level":95,"con":1698,"str":993,"cps":1190,"mp":1104,"ma":763,"md":863,"dex":1263,"att_spe":15,"walk_spe":3,"life":6900 ,"max_ski":5,"skill": ({74132,74117,74122,74201,}),"iLev":95,"cKind":"人形"]),
		"死囚" : (["level":95,"con":1698,"str":993,"cps":1190,"mp":1104,"ma":763,"md":863,"dex":1263,"att_spe":15,"walk_spe":3,"life":6900 ,"max_ski":5,"skill": ({74107,74113,74201,74214,}),"iLev":95,"cKind":"人形"]),
//		"镇天石俑" : (["level":95,"con":1698,"str":993,"cps":1190,"mp":1104,"ma":763,"md":863,"dex":1263,"att_spe":15,"walk_spe":3,"life":6900 ,"max_ski":5,"skill": ({74123,74103,74213,74116,}),"iLev":95,"cKind":"无"]),
		"金精" : (["level":95,"con":1714,"str":998,"cps":1197,"mp":1114,"ma":769,"md":869,"dex":1269,"att_spe":15,"walk_spe":3,"life":6900 ,"max_ski":5,"skill": ({74116,74112,74107,}),"iLev":96,"cKind":"无"]),
		"木精" : (["level":95,"con":1714,"str":998,"cps":1197,"mp":1114,"ma":769,"md":869,"dex":1269,"att_spe":15,"walk_spe":3,"life":6900 ,"max_ski":5,"skill": ({74109,74107,74110,}),"iLev":96,"cKind":"无"]),
		"水精" : (["level":95,"con":1714,"str":998,"cps":1197,"mp":1114,"ma":769,"md":869,"dex":1269,"att_spe":15,"walk_spe":3,"life":6900 ,"max_ski":5,"skill": ({74210,74109,74110,}),"iLev":96,"cKind":"无"]),
		"火精" : (["level":95,"con":1714,"str":998,"cps":1197,"mp":1114,"ma":769,"md":869,"dex":1269,"att_spe":15,"walk_spe":3,"life":6900 ,"max_ski":5,"skill": ({74133,74118,74227,}),"iLev":96,"cKind":"无"]),
		"土精" : (["level":95,"con":1714,"str":998,"cps":1197,"mp":1114,"ma":769,"md":869,"dex":1269,"att_spe":15,"walk_spe":3,"life":6900 ,"max_ski":5,"skill": ({74211,74109,74110,}),"iLev":96,"cKind":"无"]),
		"暗杀弩" : (["level":100,"con":1775,"str":1016,"cps":1223,"mp":1154,"ma":791,"md":891,"dex":1291,"att_spe":15,"walk_spe":3,"life":7000 ,"max_ski":5,"skill": ({74123,74101,74114,74231,}),"iLev":100,"cKind":"人形"]),
		"双斧妖" : (["level":100,"con":1775,"str":1016,"cps":1223,"mp":1154,"ma":791,"md":891,"dex":1291,"att_spe":15,"walk_spe":3,"life":7000 ,"max_ski":5,"skill": ({74123,74102,74114,74204,}),"iLev":100,"cKind":"人形"]),
		"罐中仙" : (["level":100,"con":1806,"str":1024,"cps":1237,"mp":1174,"ma":803,"md":903,"dex":1303,"att_spe":15,"walk_spe":3,"life":7000 ,"max_ski":5,"skill": ({74132,74117,74124,}),"iLev":102,"cKind":"妖"]),
		"龟仙人" : (["level":100,"con":1837,"str":1033,"cps":1250,"mp":1194,"ma":814,"md":914,"dex":1314,"att_spe":15,"walk_spe":3,"life":7000 ,"max_ski":5,"skill": ({74134,74119,74124,}),"iLev":104,"cKind":"仙"]),
		"判命道士" : (["level":105,"con":1852,"str":1038,"cps":1257,"mp":1204,"ma":820,"md":920,"dex":1320,"att_spe":15,"walk_spe":3,"life":7100 ,"max_ski":6,"skill": ({74123,74201,74205,74130,}),"iLev":105,"cKind":"人形"]),
		"狂战锤" : (["level":105,"con":1852,"str":1038,"cps":1257,"mp":1204,"ma":820,"md":920,"dex":1320,"att_spe":15,"walk_spe":3,"life":7100 ,"max_ski":6,"skill": ({74214,74202,74114,74130,}),"iLev":105,"cKind":"人形"]),
		"天罡门众守" : (["level":105,"con":1868,"str":1042,"cps":1263,"mp":1214,"ma":826,"md":926,"dex":1326,"att_spe":15,"walk_spe":3,"life":7100 ,"max_ski":6,"skill": ({74101,74102,74125,}),"iLev":106,"cKind":"人形"]),
		"守阵天兵" : (["level":105,"con":1868,"str":1042,"cps":1263,"mp":1214,"ma":826,"md":926,"dex":1326,"att_spe":15,"walk_spe":3,"life":7100 ,"max_ski":6,"skill": ({74101,74112,74124,}),"iLev":106,"cKind":"仙"]),
		"守阵神将" : (["level":105,"con":1868,"str":1042,"cps":1263,"mp":1214,"ma":826,"md":926,"dex":1326,"att_spe":15,"walk_spe":3,"life":7100 ,"max_ski":6,"skill": ({74125,74105,74110,74109,}),"iLev":106,"cKind":"仙"]),
		"地煞门众守" : (["level":105,"con":1883,"str":1047,"cps":1270,"mp":1224,"ma":831,"md":931,"dex":1331,"att_spe":15,"walk_spe":3,"life":7100 ,"max_ski":6,"skill": ({74122,74114,74116,74112,}),"iLev":107,"cKind":"人形"]),
		"太极门众守" : (["level":105,"con":1898,"str":1051,"cps":1277,"mp":1234,"ma":837,"md":937,"dex":1337,"att_spe":15,"walk_spe":3,"life":7100 ,"max_ski":6,"skill": ({74128,74109,74126,}),"iLev":108,"cKind":"人形"]),
		"霸刀将军" : (["level":110,"con":1929,"str":1060,"cps":1290,"mp":1254,"ma":849,"md":949,"dex":1349,"att_spe":15,"walk_spe":3,"life":7200 ,"max_ski":6,"skill": ({74123,74213,74114,74116,74112,}),"iLev":110,"cKind":"人形"]),
		"飞云将军" : (["level":110,"con":1929,"str":1060,"cps":1290,"mp":1254,"ma":849,"md":949,"dex":1349,"att_spe":15,"walk_spe":3,"life":7200 ,"max_ski":6,"skill": ({74123,74122,74114,74116,74203,}),"iLev":110,"cKind":"人形"]),
		"刀魂" : (["level":110,"con":1960,"str":1069,"cps":1303,"mp":1274,"ma":860,"md":960,"dex":1360,"att_spe":15,"walk_spe":3,"life":7200 ,"max_ski":6,"skill": ({74113,74101,74111,}),"iLev":112,"cKind":"亡灵"]),
		"剑魂" : (["level":110,"con":1960,"str":1069,"cps":1303,"mp":1274,"ma":860,"md":960,"dex":1360,"att_spe":15,"walk_spe":3,"life":7200 ,"max_ski":6,"skill": ({74110,74130,74114,74112,}),"iLev":112,"cKind":"亡灵"]),
		"枪魂" : (["level":110,"con":1960,"str":1069,"cps":1303,"mp":1274,"ma":860,"md":960,"dex":1360,"att_spe":15,"walk_spe":3,"life":7200 ,"max_ski":6,"skill": ({74101,74103,74104,74112,}),"iLev":112,"cKind":"亡灵"]),

//以下为神兽
		"鼠" : (["level":0,"con":1975,"str":1379,"cps":1589,"mp":804,"ma":606,"md":1006,"dex":1726,"att_spe":15,"walk_spe":3,"life":10000 ,"max_ski":10,"skill": ({74001,74202,74220,74214,74205,}),"iLev":0,"cKind":"仙"]),
		"牛" : (["level":0,"con":1975,"str":1379,"cps":1589,"mp":804,"ma":606,"md":1006,"dex":1726,"att_spe":15,"walk_spe":3,"life":10000 ,"max_ski":10,"skill": ({74001,74218,74213,74214,74205,}),"iLev":0,"cKind":"仙"]),
		"虎" : (["level":0,"con":1975,"str":555,"cps":1289,"mp":604,"ma":606,"md":806,"dex":1726,"att_spe":15,"walk_spe":3,"life":10000 ,"max_ski":10,"skill": ({74001,74207,74219,74214,74243,}),"iLev":0,"cKind":"仙"]),
		"兔" : (["level":0,"con":1975,"str":1379,"cps":1589,"mp":804,"ma":606,"md":1006,"dex":1726,"att_spe":15,"walk_spe":3,"life":10000 ,"max_ski":10,"skill": ({74001,74202,74216,74214,74205,}),"iLev":0,"cKind":"仙"]),
		"龙" : (["level":0,"con":1975,"str":1379,"cps":1589,"mp":804,"ma":606,"md":1006,"dex":1726,"att_spe":15,"walk_spe":3,"life":10000 ,"max_ski":10,"skill": ({74001,74231,74225,74214,74205,}),"iLev":0,"cKind":"仙"]),
		"蛇" : (["level":0,"con":1975,"str":1379,"cps":1589,"mp":804,"ma":606,"md":1006,"dex":1726,"att_spe":15,"walk_spe":3,"life":10000 ,"max_ski":10,"skill": ({74001,74218,74207,74214,74205,}),"iLev":0,"cKind":"仙"]),
		"马" : (["level":0,"con":1975,"str":1379,"cps":1589,"mp":804,"ma":606,"md":1006,"dex":1726,"att_spe":15,"walk_spe":3,"life":10000 ,"max_ski":10,"skill": ({74001,74202,74215,74214,74205,}),"iLev":0,"cKind":"仙"]),
		"羊" : (["level":0,"con":1975,"str":1379,"cps":1589,"mp":804,"ma":606,"md":1006,"dex":1726,"att_spe":15,"walk_spe":3,"life":10000 ,"max_ski":10,"skill": ({74001,74241,74211,74214,74205,}),"iLev":0,"cKind":"仙"]),
		"猴" : (["level":0,"con":1975,"str":1379,"cps":1589,"mp":804,"ma":606,"md":1006,"dex":1726,"att_spe":15,"walk_spe":3,"life":10000 ,"max_ski":10,"skill": ({74001,74223,74210,74214,74205,}),"iLev":0,"cKind":"仙"]),
		"鸡" : (["level":0,"con":1975,"str":1379,"cps":1589,"mp":804,"ma":606,"md":1006,"dex":1726,"att_spe":15,"walk_spe":3,"life":10000 ,"max_ski":10,"skill": ({74001,74218,74225,74214,74205,}),"iLev":0,"cKind":"仙"]),
		"狗" : (["level":0,"con":1975,"str":1379,"cps":1589,"mp":804,"ma":606,"md":1006,"dex":1726,"att_spe":15,"walk_spe":3,"life":10000 ,"max_ski":10,"skill": ({74001,74213,74225,74214,74205,}),"iLev":0,"cKind":"仙"]),
		"猪" : (["level":0,"con":1975,"str":1379,"cps":1589,"mp":804,"ma":606,"md":1006,"dex":1726,"att_spe":15,"walk_spe":3,"life":10000 ,"max_ski":10,"skill": ({74001,74203,74225,74214,74205,}),"iLev":0,"cKind":"仙"]),
		"水瓶" : (["level":0,"con":1803,"str":676,"cps":1491,"mp":1794,"ma":1270,"md":1297,"dex":1704,"att_spe":25,"walk_spe":3,"life":10000 ,"max_ski":10,"skill": ({74001,74210,74228,74213,74206,}),"iLev":0,"cKind":"仙"]),
		"双鱼" : (["level":0,"con":1803,"str":676,"cps":1491,"mp":1794,"ma":1270,"md":1297,"dex":1704,"att_spe":25,"walk_spe":3,"life":10000 ,"max_ski":10,"skill": ({74001,74108,74134,74107,74206,}),"iLev":0,"cKind":"仙"]),
		"牧羊" : (["level":0,"con":1803,"str":676,"cps":1491,"mp":1794,"ma":1270,"md":1297,"dex":1704,"att_spe":25,"walk_spe":3,"life":10000 ,"max_ski":10,"skill": ({74001,74211,74229,74126,74206,}),"iLev":0,"cKind":"仙"]),
		"金牛" : (["level":0,"con":1803,"str":676,"cps":1491,"mp":1794,"ma":1270,"md":1297,"dex":1704,"att_spe":25,"walk_spe":3,"life":10000 ,"max_ski":10,"skill": ({74001,74203,74135,74110,74206,}),"iLev":0,"cKind":"仙"]),
		"双子" : (["level":0,"con":1803,"str":676,"cps":1491,"mp":1794,"ma":1270,"md":1297,"dex":1704,"att_spe":25,"walk_spe":3,"life":10000 ,"max_ski":10,"skill": ({74001,74209,74227,74104,74206,}),"iLev":0,"cKind":"仙"]),
		"巨蟹" : (["level":0,"con":1803,"str":676,"cps":1491,"mp":1794,"ma":1270,"md":1297,"dex":1704,"att_spe":25,"walk_spe":3,"life":10000 ,"max_ski":10,"skill": ({74001,74203,74133,74111,74206,}),"iLev":0,"cKind":"仙"]),
		"狮子" : (["level":0,"con":1803,"str":676,"cps":1491,"mp":1794,"ma":1270,"md":1297,"dex":1704,"att_spe":25,"walk_spe":3,"life":10000 ,"max_ski":10,"skill": ({74001,74104,74226,74208,74206,}),"iLev":0,"cKind":"仙"]),
		"处女" : (["level":0,"con":1803,"str":676,"cps":1491,"mp":1794,"ma":1270,"md":1297,"dex":1704,"att_spe":25,"walk_spe":3,"life":10000 ,"max_ski":10,"skill": ({74001,74105,74132,74213,74206,}),"iLev":0,"cKind":"仙"]),
		"天秤" : (["level":0,"con":1803,"str":676,"cps":1491,"mp":1794,"ma":1270,"md":1297,"dex":1704,"att_spe":25,"walk_spe":3,"life":10000 ,"max_ski":10,"skill": ({74001,74106,74133,74213,74206,}),"iLev":0,"cKind":"仙"]),
		"天蝎" : (["level":0,"con":1803,"str":676,"cps":1491,"mp":1794,"ma":1270,"md":1297,"dex":1704,"att_spe":25,"walk_spe":3,"life":10000 ,"max_ski":10,"skill": ({74001,74110,74226,74208,74206,}),"iLev":0,"cKind":"仙"]),
		"射手" : (["level":0,"con":1803,"str":676,"cps":1491,"mp":1794,"ma":1270,"md":1297,"dex":1704,"att_spe":25,"walk_spe":3,"life":10000 ,"max_ski":10,"skill": ({74001,74211,74229,74232,74206,}),"iLev":0,"cKind":"仙"]),
		"摩羯" : (["level":0,"con":1803,"str":676,"cps":1491,"mp":1794,"ma":1270,"md":1297,"dex":1704,"att_spe":25,"walk_spe":3,"life":10000 ,"max_ski":10,"skill": ({74001,74203,74226,74232,74206,}),"iLev":0,"cKind":"仙"]),

//以下为特殊处理对象
		"月兔" : ([]),
		"坏小猴" : ([]),
		"坏小猪" : ([]),
		"坏大熊" : ([]),

		]); 

mapping mpBeastYutu = ([ 
		"月兔" : (["rand":25,"name":"小月兔","file":"item/04/moonrabbit",]),
		"坏小猴" : (["rand":30,"name":"装着坏小猴的神奇葫芦","file":"item/04/0455",]),
		"坏小猪" : (["rand":20,"name":"装着坏小猪的神奇葫芦","file":"item/04/0456",]),
		"坏大熊" : (["rand":10,"name":"装着坏大熊的神奇葫芦","file":"item/04/0457",]),
		]); 

string *nShenshou = ({
	"鼠" ,"牛" ,"虎" ,"兔" ,"龙" ,"蛇" ,"马" ,"羊" ,"猴" ,"鸡" ,"狗" ,"猪" ,
	"水瓶", "双鱼", "牧羊", "金牛", "双子", "巨蟹", "狮子", "处女", "天秤", "天蝎", "射手", "摩羯", 
	});		
mapping mpBeastSkill = ([ 
		"防盾" : 74101, "法盾" : 74102, "御毒术" : 74103, "封魔免疫" : 74104, "梦游免疫" : 74105, "昏迷免疫" : 74106, "延缓免疫" : 74107, "负伤免疫" : 74108, "失明免疫" : 74109, "诅咒免疫" : 74110, "御晕" : 74111, 
		"复生" : 74112, "暴击" : 74113, "强攻" : 74114, "御法" : 74115, "毒牙" : 74116, "御雷" : 74117, "御火" : 74118, "御水" : 74119, "御土" : 74120, "狂攻" : 74121, "御命术" : 74122, 
		"飞行术" : 74123, "弱点物理" : 74124, "弱点法术" : 74125, "沉睡术" : 74126, "衰神附体" : 74127, "神知" : 74128, "吸魂" : 74129, "弱点攻击" : 74130, "阴阳之术" : 74131, "雷电" : 74132, "火攻" : 74133, 
		"水击" : 74134, "落石" : 74135, "燃烧" : 74136, "磁能波动" : 74137, "冰冻" : 74138, "束缚" : 74139, "纠缠" : 74140, "高级防盾" : 74201, "高级法盾" : 74202, "高级复生" : 74203, "高级暴击" : 74204, 
		"高级强攻" : 74205, "高级御法" : 74206, "高级毒牙" : 74207, "高级御雷" : 74208, "高级御火" : 74209, "高级御水" : 74210, "高级御土" : 74211, "高级狂攻" : 74212, "高级御命术" : 74213, "高级飞行术" : 74214, "伤害纵深" : 74215, 
		"伤害光环" : 74216, "法术光环" : 74217, "物防光环" : 74218, "法防光环" : 74219, "血气光环" : 74220, "福星高照" : 74221, "绝对屏障" : 74223, "福祸相依" : 74224, "高级神知" : 74225, "雷电交加" : 74226, 
		"灭天火法" : 74227, "翻云覆雨" : 74228, "飞沙走石" : 74229, "高级吸魂" : 74230, "高级弱点攻击" : 74231, "高级阴阳之术" : 74232, "高级燃烧" : 74233, "高级磁能波动" : 74234, "高级冰冻" : 74235, "高级束缚" : 74236, "封魔术" : 74237, 
		"退敌术" : 74238, "困敌术" : 74239, "附妖术" : 74240, "冲锋" : 74241, "灵魂枷锁" : 74242, 
//		 "穿刺" : 74222,
		"表演" : 74001, "变身" : 74243,
		]); 
mapping mpProp = ([
//除以10使用
//气血系数	法力系数 物理攻击力系数	物理防御力系数	法术攻击力系数	法术防御力系数	躲闪系数
"人形"	: ({ 90,43,33,45,48,20,15 }),
"动物"	: ({ 85,35,30,50,46,18,12 }),
"昆虫"	: ({ 85,34,31,41,47,19,50 }),
"妖"	: ({ 97,45,34,49,53,21,17 }),
"仙"	: ({ 99,50,35,46,43,26,16 }),
"亡灵"	: ({ 110,46,38,40,42,22,17 }),
"无"	: ({ 95,40,36,49,41,20,15 }),

		]);
		
mapping mpDropSkill1 = ([

	"防盾"		:240,		"飞行术"	:640,
	"法盾"		:240,		"弱点物理"	:240,
	"御毒术"	:240,		"弱点法术"	:240,
	"封魔免疫"	:240,		"沉睡术"	:240,
	"梦游免疫"	:240,		"衰神附体"	:240,
	"昏迷免疫"	:240,		"神知"		:240,
	"延缓免疫"	:240,		"吸魂"		:240,
	"负伤免疫"	:240,		"弱点攻击"	:240,
	"失明免疫"	:240,		"阴阳之术"	:240,
	"诅咒免疫"	:240,		"雷电"		:240,
	"御晕"		:240,		"火攻"		:240,
	"复生"		:240,		"水击"		:240,
	"暴击"		:240,		"落石"		:240,
	"强攻"		:240,		"燃烧"		:240,
	"御法"		:240,		"磁能波动"	:240,
	"毒牙"		:240,		"冰冻"		:240,
	"御雷"		:240,		"束缚"		:240,
	"御火"		:240,		"纠缠"		:240,
	"御水"		:240,			
	"御土"		:240,			
	"狂攻"		:240,			
	"御命术"	:240,			

]);		

mapping mpDropSkill2 = ([

	"高级防盾" 	:1,		"福祸相依" 	:1,																																				
	"高级法盾" 	:1,		"高级神知" 	:1,																																				
	"高级复生" 	:1,		"雷电交加" 	:1,																																				
	"高级暴击" 	:1,		"灭天火法" 	:1,																																				
	"高级强攻" 	:1,		"翻云覆雨" 	:1,																																				
	"高级御法" 	:1,		"飞沙走石" 	:1,																																				
	"高级毒牙" 	:1,		"高级吸魂" 	:1,																																				
	"高级御雷" 	:1,		"高级弱点攻击" 	:1,																																				
	"高级御火" 	:1,		"高级阴阳之术" 	:1,																																				
	"高级御水" 	:1,		"高级燃烧" 	:1,																																				
	"高级御土" 	:1,		"高级磁能波动" 	:1,																																				
	"高级狂攻" 	:1,		"高级冰冻" 	:1,																																				
	"高级御命术" 	:1,		"高级束缚" 	:1,																																				
	"高级飞行术" 	:1,		"封魔术" 	:1,																																				
	"伤害纵深" 	:1,		"退敌术" 	:1,																																				
	"伤害光环" 	:1,		"困敌术" 	:1,																																				
	"法术光环" 	:1, 		"附妖术" 	:1,																																				
	"物防光环" 	:1,		"冲锋" 		:1,																																				
	"法防光环" 	:1,		"灵魂枷锁" 	:1,																																				
	"血气光环" 	:1,																																						
	"福星高照" 	:1,																																						
	"绝对屏障" 	:1,		

]);
//宠物变色
mapping mpColor = ([
	"小蜜蜂" : 0xfac1, "小蚂蚁" : 0x323a, "斑点蛙" : 0x29a5, "持扇草人" : 0x39f4, 
	"山鸡王" : 0x41a7, "兔子王" : 0x51a5, "子母蛙" : 0x29c6, "斑点狗" : 0x5228, 
	"独角仙" : 0x2941, "刺尾蜂" : 0xb560, "兵蚁" : 0x329c, "蛙妖" : 0x8208, 
	"独眼兽" : 0x28e3, "黑熊" : 0x1c7, "猩猩王" : 0x1a6, "甲虫大将军" : 0xac62, 
	"冤鬼" : 0x49af, "鬼魅" : 0x6820, "骷髅兵" : 0x7206, "毒刺蜂" : 0xe1c2, 
	"灯魂" : 0x37c0, "毒蝎子" : 0x4221, "毒蜘蛛" : 0x720d, "癞蛤蟆" : 0x396a, 
	"黑熊" : 0x248, "赤炎蛇" : 0x2a05, "螳螂妖" : 0x69a9, "大灰熊" : 0x338, 
	"绿壳蜘蛛" : 0x220, "魍魉" : 0x1001, "魍魉鬼" : 0x1e0, "冤魂" : 0x416d, 
	"魍魉鬼" : 0x1e0, "恶灵" : 0x9409, "侍卫亡灵" : 0xa145, "怨魂精灵" : 0x21c1, 
	"蚀魔" : 0x4213, "精兵冤灵" : 0x40f2, "骷髅妖" : 0x6225, "骸骨精" : 0x6225, 
	"邪灵" : 0x644b, "骷髅侍卫" : 0x416d, "尸魔" : 0x61c0, "守墓石狮" : 0x4a27, 
	"守墓石虎" : 0x4a27, "怨灵" : 0x4232, "精锐石俑" : 0x49e5, "病魔" : 0x9c5, 
	"骷髅统领" : 0x416d, "骸灵" : 0x1a0f, 
]);
mapping mpSkiDesc = ([
74101 : "拥有此技能的宠物，增加其当前物理防御的10%。",
74102 : "拥有此技能的宠物，增加其当前法术防御的5%。",
74103 : "拥有此技能的宠物，不会陷入中毒状态。",
74104 : "拥有此技能的宠物，不会陷入被封魔状态。",
74105 : "拥有此技能的宠物，不会陷入梦游状态。",
74106 : "拥有此技能的宠物，不会陷入昏迷状态。",
74107 : "拥有此技能的宠物，不会陷入延缓状态。",
74108 : "拥有此技能的宠物，不会陷入负伤状态。",
74109 : "拥有此技能的宠物，不会陷入失明状态。",
74110 : "拥有此技能的宠物，不会受到任何诅咒性法术的影响。",
74111 : "拥有此技能的宠物，不会陷入眩晕状态。",
74112 : "拥有此技能的宠物，在非技能冷却时间的时候死亡，\n不会马上被回收。而是延时10秒后自动复活。复活\n后其气血与法术均剩下20％。技能有30分钟的使用\n冷冻时间。复活后，宠物寿命值和忠诚度均按宠物\n正常死亡减扣，即寿命值减去50，忠诚度减去20。\n",
74113 : "拥有此技能的宠物，将提高其当前\n（物理攻击/法术攻击）暴击几率的5%",
74114 : "拥有此技能的宠物，将提高其当前物理攻击力的10%。",
74115 : "拥有此技能的宠物，将提高其当前法术攻击力的10%。",
74116 : "拥有此技能的宠物，物理攻击时15％几率使敌人中毒，中毒者\n会每2秒受到15点毒性伤害，持续20秒，技能效果不叠加。",
74117 : "拥有此技能的宠物，抵御雷系攻击法术30%的伤害。",
74118 : "拥有此技能的宠物，抵御火系攻击法术30%的伤害。",
74119 : "拥有此技能的宠物，抵御水系攻击法术30%的伤害。",
74120 : "拥有此技能的宠物，抵御土系攻击法术30%的伤害。",
74121 : "拥有此技能的宠物，5%的几率对敌方造成连续2次物理伤害。",
74122 : "拥有此技能的宠物，增加其当前气血上限的15%。",
74123 : "拥有此技能的宠物，能提高宠物自身\n10%的躲闪和20%的物理攻击速度。",
74124 : "拥有此技能的宠物，宠物受到的所有物理攻击伤害均会增加5％。",
74125 : "拥有此技能的宠物，宠物受到的所有法术攻击伤害均会增加5％。",
74126 : "拥有此技能的宠物，被近身物理攻击时，\n攻击方有10%几率处于梦游状态并持续6秒。",
74127 : "拥有此技能的宠物，宠物在进行物理攻击或法术攻击时，\n其攻击值均取最小值。而被宠物攻击方，其物理防御值\n和法术防御值均取最大值。",
74128 : "拥有此技能的宠物，使用此技能，能探知以宠物\n自身为中心的5×5格范围内所有隐身的目标，技能\n有20秒冷却时间，使其现出原形。",
74129 : "拥有此技能的宠物，使用此技能在对敌人造成\n物理伤害的同时增加伤害值5%的气血。",
74130 : "拥有此技能的宠物，使用此技能物理攻击时，忽视\n对方15%的物理防御。技能有5秒冷却时间间隔。",
74131 : "拥有此技能的宠物，使用此技能法术攻击时，忽视\n对方15%的法术防御。技能有5秒冷却时间间隔。",
74132 : "拥有此技能的宠物，使用此技能会用雷击法术攻击单一目标。",
74133 : "拥有此技能的宠物，使用此技能会用火法术攻击单一目标。",
74134 : "拥有此技能的宠物，使用此技能会用水法术攻击单一目标。",
74135 : "拥有此技能的宠物，使用此技能会用土法术攻击单一目标。",
74136 : "拥有此技能的宠物，使用此技能攻击对方时，\n15%的几率使对方处于焚烧状态20秒，每2秒\n中降低气血10点，技能效果不叠加。",
74137 : "拥有此技能的宠物，使用此技能攻击对方时，\n能使对方陷入3秒的眩晕状态，技能效果不\n叠加。（技能冷却时间20秒。）",
74138 : "拥有此技能的宠物，使用此技能攻击对方时，\n能使对方陷入3秒的冰冻状态，技能效果不\n叠加。（技能冷却时间20秒。）",
74139 : "拥有此技能的宠物，使用此技能攻击对方时，\n能延缓对方3秒的移动速度，技能效果不\n叠加。（技能冷却时间20秒。）",
74140 : "拥有此技能的宠物，使用此技能，能将主人\n所见范围内任意一只怪吸引过来去攻击宠物\n本身6秒，技能冷却2秒。",
74201 : "拥有此技能的宠物，增加其当前物理防御的25%。",
74202 : "拥有此技能的宠物，增加其当前法术防御的13%。",
74203 : "拥有此技能的宠物，在非技能冷却时间的时候死亡，\n不会马上被回收。而是延时10秒后自动\n复活。复活后其气血与法术均剩下50％。技能有30分\n钟的使用冷冻时间。复活后，宠物寿命值和忠诚\n度均按宠物正常死亡减扣，即寿命值减\n去50，忠诚度减去20。",
74204 : "拥有此技能的宠物，将提高其当前\n（物理攻击/法术攻击）暴击几率的10%",
74205 : "拥有此技能的宠物，将提高其当前物理攻击力的20%。",
74206 : "拥有此技能的宠物，将提高其当前法术攻击力的20%。",
74207 : "拥有此技能的宠物，物理攻击时15％几率使敌人中毒，\n中毒者会每2秒受到30点毒性伤害，持续\n20秒，效果无叠加",
74208 : "拥有此技能的宠物，抵御雷系攻击法术60%的伤害。",
74209 : "拥有此技能的宠物，抵御火系攻击法术60%的伤害。",
74210 : "拥有此技能的宠物，抵御水系攻击法术60%的伤害。",
74211 : "拥有此技能的宠物，抵御土系攻击法术60%的伤害。",
74212 : "拥有此技能的宠物，15%的几率对敌方造成连续2次物理伤害。",
74213 : "拥有此技能的宠物，增加其当前气血上限的30%。",
74214 : "拥有此技能的宠物，能提高宠物自身\n20%的躲闪和40%的物理攻击速度。",
74215 : "拥有此技能的宠物，攻击对方有20%的几率造成对方流血\n状态，持续10秒，每2秒减少20气血，技能效果不叠加。",
74216 : "拥有此技能的宠物，当其被召唤出来时，\n其主人物理攻击力将增加5%，当此宠物\n被收回或死亡时，其主人物理伤害上限恢复正常。",
74217 : "拥有此技能的宠物，当其被召唤出来时，\n其主人法术攻击力将增加5%，当此宠物\n被收回或死亡时，其主人法术伤害上限恢复正常。",
74218 : "拥有此技能的宠物，当其被召唤出来时，\n其主人物理防御将增加5%，当此宠物\n被收回或死亡时，其主人物理防御上限恢复正常。",
74219 : "拥有此技能的宠物，当其被召唤出来时，\n其主人法术防御将增加5%，当此宠物\n被收回或死亡时，其主人法术防御上限恢复正常。",
74220 : "拥有此技能的宠物，当其被召唤出来时，\n其主人气血将增加5%，当此宠物被收回或死亡时，其主人气血上限恢复正常。",
74221 : "拥有此技能的宠物，宠物在进行物理攻击或法术攻击时，\n其攻击值均取最大值。而被宠物攻击方，其物理\n防御值和法术防御值均取最小值。 ",
74223 : "拥有此技能的宠物，使用技能后，持续10秒\n使敌方对该宠物造成的所有伤害均无效以及该\n宠物对敌方造成的所有伤害也无效，技能冷却30秒。",
74224 : "拥有此技能的宠物，使用技能后，其物理攻击\n力和法术攻击力均增加10%，持\n续10秒，但其在这10秒内受到的治疗\n效果减50%。（治疗效果：包括云梦的：疗伤、医疗\n、群疗、治愈术。蜀山的：疗伤术。）",
74225 : "拥有此技能的宠物，使用此技能，能探知以宠\n物自身为中心的7×7格范围内所有隐身的目标，\n使其现出原形。技能有20秒冷冻时间。",
74226 : "拥有此技能的宠物，使用此技能会\n用雷击法术攻击3×3范围内目标。",
74227 : "拥有此技能的宠物，使用此技能会\n用火法术攻击3×3范围内目标。",
74228 : "拥有此技能的宠物，使用此技能会\n用水法术攻击3×3范围内目标。",
74229 : "拥有此技能的宠物，使用此技能会\n用土法术攻击3×3范围内目标。",
74230 : "拥有此技能的宠物，使用此技能在对敌人\n造成物理伤害的同时自身增加对敌的伤\n害值10%的气血。",
74231 : "拥有此技能的宠物，使用此技能物理攻击时，\n忽视对方30%的物理防御。技能有5秒冷却时间间隔。",
74232 : "拥有此技能的宠物，使用此技能法术攻击时，\n忽视对方30%的法术防御。技能有5秒冷却时间间隔。",
74233 : "拥有此技能的宠物，使用此技能攻击对方时，\n30%的几率使对方处于焚烧状态20秒，每2秒中\n降低气血10点，技能效果不叠加。",
74234 : "拥有此技能的宠物，使用此技能攻击对方时，\n能使对方陷入6秒的眩晕状态，技能效果不叠加。\n（技能冷却时间20秒。）",
74235 : "拥有此技能的宠物，使用此技能攻击对方时，\n能使对方陷入6秒的冰冻状态，技能效果不叠加。\n（技能冷却时间20秒。）",
74236 : "拥有此技能的宠物，使用此技能攻击对方时，\n能延缓对方6秒的移动速度，技能效果不叠加。\n（技能冷却时间10秒）",
74237 : "拥有此技能的宠物，使用此技能击中对方，\n能使对方2秒内无法使用法术并给对方造成一点伤害，\n技能冷却15秒。",
74238 : "拥有此技能的宠物，使用此技能，有50%击退对方6格，\n对BOSS无效，若击退成功，则被击方退6格。",
74239 : "拥有此技能的宠物，使用此技能近身击中对方，\n有30%的几率持续6秒将对方困在一个3×3的范围内，\n技能冷却15秒。",
74240 : "拥有此技能的宠物，使用技能时，能触发宠物所见\n范围21×21内的怪去攻击宠物本身，技能冷却15秒。",
74241 : "拥有此技能的宠物，使用此技能，锁定宠物所见范围\n内的任一目标，瞬移其身边进行攻击，并将其所选\n定目标眩晕1秒，技能冷却30秒",
74242 : "拥有此技能的宠物，使用此技能，能将主人所承受\n的伤害转移到宠物身上 ，转换比例为1：2，即宠物承受双\n倍于主人的伤害；同样，宠物所受到的伤害也\n以2：1的比例转换到主人身上。(技能效果持续10分钟)",
74243 : "拥有此技能的老虎，使用该技能后,\n老虎将变成超级状态,其气血、物防、\n法防、物攻等所有属性效果将提高一倍.该状态\n将持续15分钟，15分钟后恢复正常状态。\n技能冷却时间30分钟。",
	]);
//宠物头像	
mapping mpPetPic = ([
	 "小山鸡" : 0010, "小野兔" : 0011, "稻草人" : 0012, "小蜜蜂" : 0150,
	 "小蚂蚁" : 0151, "斑点蛙" : 0304, "持扇草人" : 0012, "赤褐蚁" : 0151,
	 "山鸡王" : 0010, "兔子王" : 0011, "稻田守卫" : 0012, "子母蛙" : 0304,
	 "楚军刀兵" : 0050, "楚军剑兵" : 0051, "斑点狗" : 0101, "四脚蛇" : 0102,
	 "独角仙" : 0302, "刺尾蜂" : 0150, "棕熊" : 0500, "狒狒" : 0100,
	 "绿臂螳螂" : 0152, "兵蚁" : 0151, "蛙妖" : 0304, "独眼兽" : 0101,
	 "楚国精兵" : 0050, "楚国精兵" : 0051, "黑熊" : 0500, "猩猩王" : 0100,
	 "甲虫大将军" : 0302, "地痞" : 0052, "打手" : 0201, "鬼火" : 0901,
	 "幽灵" : 0900, "飞贼" : 0202, "恶少" : 0053, "恶老头" : 0250,
	 "恶屠" : 0200, "狂徒" : 0201, "巡城小兵" : 5209, "斥候" : 1000,
	 "土匪" : 0251, "草寇" : 0250, "江洋大盗" : 0202, "冤鬼" : 0752,
	 "赵国巡逻兵" : 0600, "燕国巡逻兵" : 0552, "马贼" : 8012, "秦国守军" : 0651,
	 "秦弓箭手" : 0652, "恶霸" : 0251, "鬼魅" : 0901, "骷髅兵" : 0801,
	 "小队长" : 5209, "褐尾蝎" : 0300, "蛛蛛怪" : 0301, "毒刺蜂" : 0150,
	 "牛头怪" : 0303, "狼妖" : 0350, "猪妖" : 0351, "豺狗" : 0352,
	 "强盗头目" : 0252, "马贼首领" : 8012, "土匪头目" : 0251, "灯魂" : 0901,
	 "秦先锋步兵" : 0650, "赵先锋弓兵" : 0602, "燕先锋步兵" : 0551, "毒蝎子" : 0300,
	 "毒蜘蛛" : 0301, "狼妖头目" : 0350, "豺狗武者" : 0352, "水贼" : 8010,
	 "癞蛤蟆" : 0304, "黑熊" : 0500, "赤炎蛇" : 0102, "螳螂妖" : 0152,
	 "水贼头目" : 8010, "大灰熊" : 0500, "虾兵" : 0400, "蟹将" : 0401,
	 "弩兵" : 9969, "拳法师" : 9967, "棍师" : 9960, "壮丁" : 0450,
	 "苦役" : 0451, "劳役" : 0452, "龟丞相" : 0402, "火葫芦" : 9962,
	 "铁胖" : 9963, "飞镖客" : 9965, "绿壳蜘蛛" : 0301, "大笨熊" : 0500,
	 "魍魉" : 0901, "花豹精" : 0502, "豺狼" : 0350, "郑国渠监工" : 0252,
	 "东胡骑兵" : 8013, "燕国刀盾兵" : 0550, "燕国剑盾兵" : 0551, "燕国枪兵" : 0552,
	 "魍魉鬼" : 0901, "匈奴骑兵" : 8012, "燕国精卫" : 0552, "赵国刀盾兵" : 0600,
	 "赵国剑盾兵" : 0601, "赵国弓兵" : 0602, "逃囚" : 8000, "铁锤王" : 8011,
	 "邪道士" : 9968, "秦国刀盾兵" : 0650, "秦国枪兵" : 0651, "秦国弓兵" : 0652,
	 "赵国精卫" : 0600, "花面斧" : 9970, "黄袍妖道" : 9961, "秦国精卫" : 0651,
	 "劫匪" : 1000, "密探" : 1001, "水鬼" : 8010, "绿剑郎君" : 9964,
	 "关刀客" : 9966, "罐中妖" : 0702, "豆兵" : 4135, "刺客头目" : 8011,
	 "冤魂" : 0752, "魍魉鬼" : 0901, "疫鬼" : 0902, "恶灵" : 0900,
	 "雷葫芦" : 9962, "蒙面拳盗" : 9967, "铜甲尸" : 0751, "侍卫亡灵" : 4131,
	 "怨魂精灵" : 0752, "铁甲尸" : 0750, "豆将军" : 4145, "刀盾骷髅" : 0800,
	 "剑盾骷髅" : 0801, "双刀骷髅" : 0802, "蚀魔" : 0902, "僵尸" : 4134,
	 "石狮" : 0700, "石虎" : 0701, "伏路贼" : 9965, "铁辫王" : 9963,
	 "刀俑" : 0850, "弓箭石俑" : 0853, "枪俑" : 0852, "剑俑" : 0851,
	 "精兵冤灵" : 4141, "水火棍" : 9960, "阴阳剑" : 9964, "骷髅妖" : 0800,
	 "骸骨精" : 0801, "邪灵" : 0900, "骷髅侍卫" : 0802, "尸魔" : 0751,
	 "守墓石狮" : 0700, "守墓石虎" : 0701, "怨灵" : 0752, "僵尸王" : 4144,
	 "精锐石俑" : 0852, "风雷剑" : 9961, "死囚" : 8000, "金精" : 0950,
	 "木精" : 0951, "水精" : 0952, "火精" : 0953, "土精" : 0954,
	 "病魔" : 0902, "骷髅统领" : 0802, "骸灵" : 0750, "虚陵道人" : 1050,
	 "暗杀弩" : 9969, "双斧妖" : 9970, "罐中仙" : 0702, "玄真道人" : 1051,
	 "龟仙人" : 0402, "紫云道人" : 1052, "判命道士" : 9968, "狂战锤" : 8011,
	 "天罡门众守" : 1050, "守阵天兵" : 4132, "守阵神将" : 4133, "地煞门众守" : 1051,
	 "太极门众守" : 1052, "罐中魔" : 0702, "龟太辅" : 0402, "霸刀将军" : 9966,
	 "飞云将军" : 4143, "神兵" : 4142, "天将" : 4143, "刀魂" : 1100,
	 "剑魂" : 1101, "枪魂" : 1102, "刀鬼" : 1600, "剑鬼" : 1601,
	 "枪鬼" : 1602,
 	]);
mapping mpLevelPet = ([]);

int init_level_pet()
{
	int i,size,level;
	string *nTmp;	
	nTmp = keys(mpBeastInfo);
	for(i=0,size=sizeof(nTmp);i<size;i++)
	{
		if ( member_array(nTmp[i],nShenshou) != -1 )
			continue;
		level = mpBeastInfo[nTmp[i]]["level"];	
		if ( !arrayp(mpLevelPet[level]) )
			mpLevelPet[level] = ({});
		mpLevelPet[level] += ({ nTmp[i] });	
	}
}
//获取等级段的宠物集合
string *get_level_pet(int level)
{
	level /= 5;
	level *= 5;
	if ( level > 110 )
		level = 110;
	return 	mpLevelPet[level];
}
//获取宠物造型
int get_pet_picid(string cName) { return mpPetPic[cName];}

void create()
{
	init_level_pet();
}
//获取对应的宠物基本信息
mapping get_beast_info(string cName)
{
	return 	mpBeastInfo[cName];
}
//获取技能的ID
int get_beast_skill(string cName)
{
	return 	mpBeastSkill[cName];
}
//获取宠物系数
int *get_beast_prop(string cKind)
{
	return mpProp[cKind];	
}

//按几率获取低级技能编号
int get_drop_skill1()
{
	int i,size,p=0,ski=74101;
	int rate = random(10000);
	string *nTmp;
	
	nTmp = keys(mpDropSkill1);
	for(i=0,size=sizeof(nTmp);i<size;i++)
	{
		p += mpDropSkill1[nTmp[i]];
		if(rate>=p)	continue;
		ski = mpBeastSkill[nTmp[i]];
		break;
	}
	return ski;
}

//随机获取高级技能编号
int get_drop_skill2()
{
	int ski;
	string *nTmp;
	nTmp = keys(mpDropSkill2);
	ski = mpBeastSkill[nTmp[random(sizeof(nTmp))]];
	if ( !ski )
		ski=74201;
	return ski;
}

int get_pet_color(string cName) { return mpColor[cName]; }
//技能描述
string get_skill_desc(int skill)
{
	return mpSkiDesc[skill];	
}
//初始化精元丹技能 flag: 1 低级 2 高级
int init_item_skill(object item,int flag)
{
	int skill;
	
	if ( !item )
		return 0;
	if ( flag == 2 )
		skill = get_drop_skill2();
	else
		skill = get_drop_skill1();
	item->set("special",sprintf("%d",skill));
	return 1;
}

//捕抓玉兔类的特殊处理
void get_yutu(object player, object rabbit)
{
	int rand,move;
	object item,present;
	string i;
	rand = random(100);  
	i = rabbit->get_name();
        if(rand < mpBeastYutu[i]["rand"])
        {
		if(sizeof_inventory(player, 1, MAX_CARRY) >= MAX_CARRY )
		{
			send_user(player,"%c%s",'!',"你身上的道具栏空间不够！");
			return;
		}
        	//捕捉成功。
        	send_user(player, "%c%s", '!', "你捕捉了" + rabbit->get_name());
        	rabbit->remove_from_scene();//从场景里面移出
        	rabbit->before_destruct();
		destruct(rabbit);
		if( objectp( item = present(mpBeastYutu[i]["name"], player, 1, MAX_CARRY) ) && item->get_amount() < 30 )
		{
			item->add_amount(1);				
		}
		else
		{
			present = new(mpBeastYutu[i]["file"]);
			if(!present)
			{
				return;
			}
			if(move = present->move(player,-1))
			{
				present->add_to_user(move);
			}	
			else
			{
				destruct(present);
				return;
			}
			return ;
		}
        }	
        else
        {
        	send_user(player, "%c%s", '!', "捕抓"+rabbit->get_name()+"失败！");
        	return;
        }
}