
// 变量：任务列表
mapping PointTable = ([
        "李屠" : "10-254,110",
        "李浪" : "10-284,212",
        "孙老头" : "10-147,231",
        "王凯" : "10-275,198",
        "孔小飞" : "10-297,202",
        "崔玉" : "10-225,166",
        "齐总管" : "10-91,169",
        "齐管家" : "10-83,115",
        "老王婶" : "20-162,48",
        "马大汉" : "20-304,154",
        "赵木" : "20-219,176",
        "林为" : "20-236,179",
        "游子" : "20-139,174",
        "钱老八" : "20-228,129",
        "韩总管" : "20-206,32",
        "韩管家" : "20-168,54",
        "王铁匠" : "30-214,90",
        "脚夫" : "30-222,100",
        "李防" : "30-214,239",
        "白易" : "30-188,250",
        "赵总管" : "30-200,39",
        "赵管家" : "30-155,72",
        "程林开" : "40-106,146",
        "周童" : "40-128,152",
        "李三婶" : "40-330,184",
        "李大毛" : "40-226,230",
        "许氏" : "40-310,181",
        "纱纤小姐" : "40-88,150",
        "刘德" : "40-123,220",
        "孟求" : "40-112,199",
        "孙少爷" : "40-148,146",
        "朱狂" : "40-324,180",
        "魏总管" : "40-324,122",
        "魏管家" : "40-308,195",
        "彭尖豪" : "50-73,180",
        "马显" : "50-231,148",
        "夏侯党" : "50-252,171",
        "秦总管" : "50-36,159",
        "秦管家" : "50-73,184",
        "刘头" : "60-129,222",
        "钱老九" : "60-148,236",
        "孙陆" : "60-167,74",
        "王满" : "60-181,87",
        "丁小丫" : "60-156,226",
        "楚总管" : "60-205,267",
        "楚管家" : "60-245,229",
        "曹清" : "70-170,248",
        "丁鹤年" : "70-172,231",
        "程风" : "70-190,210",
        "燕总管" : "70-214,264",
        "燕管家" : "70-138,233",
]);

mapping PlaceTable = ([
	"程林开":  "大梁城外西方的临河镇", 
	"周童":  "大梁城外西方的临河镇", 
	"李三婶":  "大梁城内的魏公府", 
	"许氏":  "大梁城内的魏公府", 
	"刘德":  "大梁城外的西北方向", 
	"孟求":  "大梁城外西方的临河镇", 
	"朱狂":  "大梁城内的魏公府", 
	"魏管家":  "大梁城内的魏公府", 
	"李屠":  "临淄城外的临滋南郊", 
	"李浪":  "临淄城外东北方的碣石镇内", 
	"王凯":  "临淄城外东北方的碣石镇内", 
	"孔小飞":  "临淄城外东北方的碣石镇内", 
	"崔玉":  "临淄城外临滋南郊的小桥旁", 
	"齐管家":  "临淄城内的田公府", 
	"老王婶":  "郑城内的韩公府", 
	"马大汉":  "郑城外的梨花村", 
	"赵木":  "郑城外的郑城东郊", 
	"林为":  "郑城外的梨花村外", 
	"游子":  "郑城外的郑城西郊", 
	"钱老八":  "郑城外东北方的护城河旁", 
	"韩管家":  "郑城内的韩公府", 
	"刘头":  "郢城内的西方", 
	"钱老九":  "郢城内的西方", 
	"孙陆":  "郢城外南方的百越村", 
	"王满":  "郢城外南方的百越村", 
	"楚管家":  "郢城内的芈城内", 
	"王铁匠":  "邯郸城内的邯郸城", 
	"脚夫":  "邯郸城内的邯郸城", 
	"李防":  "邯郸城外北方的边陲小镇", 
	"白易":  "邯郸城外北方的边陲小镇", 
	"赵管家":  "邯郸城内的赵府", 
	"彭尖豪":  "咸阳城内的吕府", 
	"马显":  "咸阳城外的平阳镇外", 
	"夏侯党":  "咸阳城外的平阳镇", 
	"秦管家":  "咸阳城内的吕府", 
	"曹清":  "蓟城内的曹府", 
	"丁鹤年":  "蓟城内的王府", 
	"程风":  "蓟城内的禅武台", 
	"燕管家":  "蓟城内的王府", 

]);

mapping CountryTable = ([
	"程林开":   "魏", 
	"周童":     "魏", 
	"李三婶":   "魏", 
	"许氏":     "魏", 
	"刘德":     "魏", 
	"孟求":     "魏", 
	"朱狂":     "魏", 
	"魏管家":   "魏", 
	"李屠":     "齐", 
	"李浪":     "齐",  
	"王凯":     "齐",  
	"孔小飞":   "齐", 
	"崔玉":     "齐",  
	"齐管家":   "齐", 
	"老王婶":   "韩", 
	"马大汉":   "韩", 
	"赵木":     "韩", 
	"林为":     "韩", 
	"游子":     "韩", 
	"钱老八":   "韩",  
	"韩管家":   "韩", 
	"刘头":     "楚", 
	"钱老九":   "楚", 
	"孙陆":     "楚", 
	"王满":     "楚", 
	"楚管家":   "楚", 
	"王铁匠":   "赵", 
	"脚夫":     "赵", 
	"李防":     "赵", 
	"白易":     "赵", 
	"赵管家":   "赵", 
	"彭尖豪":   "秦", 
	"马显":     "秦", 
	"夏侯党":   "秦", 
	"秦管家":   "秦", 
	"曹清":     "燕", 
	"丁鹤年":   "燕", 
	"程风":     "燕", 
	"燕管家":   "燕", 
]);

string *NameTable = ({ });

int sizeof_point = sizeof(PointTable);

// 函数：构造处理
void create() { NameTable = keys(PointTable); }    // 生成名字数组

// 函数：获取任务姓名
string get_quest() { return NameTable[ random(sizeof_point) ]; }

// 函数：获取人物坐标
int get_xy_point( string name ) 
{ 
        int z, x, y;

	if( undefinedp( PointTable[name] ) ) return 0;

        if( !sscanf( PointTable[name], "%d-%d,%d", z, x, y ) ) return 0;

        return z * 1000000 + x * 1000 + y;
}

string get_place_name(string name)
{
	if( undefinedp( PlaceTable[name] ) ) return "不知所在";
	return PlaceTable[name];
}

string get_country_name(string name)
{
	if( undefinedp( CountryTable[name] ) ) return "不知名处";
	return CountryTable[name]+"国";
}